.class public final L淆淆淆淆混淆混淆淆淆混混混淆淆淆混淆淆混淆淆混混淆混淆混混混混淆淆混混混混混淆混淆混混混淆混淆混混淆淆淆混淆淆淆混混混混淆混混混混淆淆混混混淆淆淆混淆混淆混淆混淆混混淆淆淆淆淆淆混混淆淆混混混混淆淆混/淆淆淆淆淆淆混淆淆混淆混混淆淆淆淆混混混混混淆淆淆淆淆混淆淆淆淆混混混混混混混淆淆淆淆混淆混混淆淆淆淆混混混淆混混淆淆淆淆混淆混混淆混淆淆淆淆混淆混淆淆混淆混淆淆淆混淆淆混淆混混淆淆混淆淆淆混混混混淆;
.super Ljava/lang/RuntimeException;
.source "SourceFile"


# instance fields
.field public 淆淆淆淆淆淆淆淆混淆淆混混混混混淆混混混混淆混混混混淆淆淆淆淆淆淆混混混淆混淆淆淆淆混混混混淆淆混淆混淆混淆混混混混混淆混淆淆混混混淆淆混淆淆混淆混混淆淆混淆混淆淆混淆混混混混混混混混淆混混淆淆淆混混:Ljava/lang/Throwable;


# direct methods
.method public constructor <init>(Ljava/lang/String;Ljava/lang/Throwable;)V
    .registers 3

    invoke-direct {p0, p1}, Ljava/lang/RuntimeException;-><init>(Ljava/lang/String;)V

    iput-object p2, p0, L淆淆淆淆混淆混淆淆淆混混混淆淆淆混淆淆混淆淆混混淆混淆混混混混淆淆混混混混混淆混淆混混混淆混淆混混淆淆淆混淆淆淆混混混混淆混混混混淆淆混混混淆淆淆混淆混淆混淆混淆混混淆淆淆淆淆淆混混淆淆混混混混淆淆混/淆淆淆淆淆淆混淆淆混淆混混淆淆淆淆混混混混混淆淆淆淆淆混淆淆淆淆混混混混混混混淆淆淆淆混淆混混淆淆淆淆混混混淆混混淆淆淆淆混淆混混淆混淆淆淆淆混淆混淆淆混淆混淆淆淆混淆淆混淆混混淆淆混淆淆淆混混混混淆;->淆淆淆淆淆淆淆淆混淆淆混混混混混淆混混混混淆混混混混淆淆淆淆淆淆淆混混混淆混淆淆淆淆混混混混淆淆混淆混淆混淆混混混混混淆混淆淆混混混淆淆混淆淆混淆混混淆淆混淆混淆淆混淆混混混混混混混混淆混混淆淆淆混混:Ljava/lang/Throwable;

    return-void
.end method


# virtual methods
.method public final getCause()Ljava/lang/Throwable;
    .registers 2

    iget-object v0, p0, L淆淆淆淆混淆混淆淆淆混混混淆淆淆混淆淆混淆淆混混淆混淆混混混混淆淆混混混混混淆混淆混混混淆混淆混混淆淆淆混淆淆淆混混混混淆混混混混淆淆混混混淆淆淆混淆混淆混淆混淆混混淆淆淆淆淆淆混混淆淆混混混混淆淆混/淆淆淆淆淆淆混淆淆混淆混混淆淆淆淆混混混混混淆淆淆淆淆混淆淆淆淆混混混混混混混淆淆淆淆混淆混混淆淆淆淆混混混淆混混淆淆淆淆混淆混混淆混淆淆淆淆混淆混淆淆混淆混淆淆淆混淆淆混淆混混淆淆混淆淆淆混混混混淆;->淆淆淆淆淆淆淆淆混淆淆混混混混混淆混混混混淆混混混混淆淆淆淆淆淆淆混混混淆混淆淆淆淆混混混混淆淆混淆混淆混淆混混混混混淆混淆淆混混混淆淆混淆淆混淆混混淆淆混淆混淆淆混淆混混混混混混混混淆混混淆淆淆混混:Ljava/lang/Throwable;

    return-object v0
.end method
