.class public abstract L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆淆混混淆混淆淆淆淆混混淆混混淆混混混混混混混淆淆混淆淆淆混淆淆淆淆淆淆淆淆混淆混淆淆混淆淆混混淆混淆混混混混淆淆淆淆混混混淆淆淆淆混淆混淆混混淆混淆淆淆淆混混淆混混淆混混淆淆混混混混混淆混混混;
.super L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆混淆淆混淆淆混混淆淆淆混淆淆淆淆混淆淆淆混混淆混淆混淆混混淆混混淆混混混淆淆淆淆混混混混淆淆淆混淆混淆淆淆混淆淆淆淆混淆淆淆混淆淆淆混混淆混淆淆淆混混淆淆淆混淆混淆混淆混混淆淆淆混淆混混淆混混;
.source "SourceFile"


# direct methods
.method public constructor <init>()V
    .registers 1

    invoke-direct {p0}, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆混淆淆混淆淆混混淆淆淆混淆淆淆淆混淆淆淆混混淆混淆混淆混混淆混混淆混混混淆淆淆淆混混混混淆淆淆混淆混淆淆淆混淆淆淆淆混淆淆淆混淆淆淆混混淆混淆淆淆混混淆淆淆混淆混淆混淆混混淆淆淆混淆混混淆混混;-><init>()V

    return-void
.end method


# virtual methods
.method public final hashCode()I
    .registers 2

    const/4 v0, -0x1

    return v0
.end method

.method public final toString()Ljava/lang/String;
    .registers 2

    const-string v0, "NULL"

    return-object v0
.end method

.method public final 淆淆淆淆淆混淆混淆淆淆混混淆混混淆淆混混混混混淆淆混淆混混淆混混淆混混淆淆淆混淆混混淆混混混混混混混混混淆淆淆淆混混淆淆混淆淆混混淆混淆混淆混混混淆淆淆淆淆淆淆淆混混混混淆混混混淆淆混混淆淆混混淆淆混(L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆混淆淆混淆淆混混淆淆淆混淆淆淆淆混淆淆淆混混淆混淆混淆混混淆混混淆混混混淆淆淆淆混混混混淆淆淆混淆混淆淆淆混淆淆淆淆混淆淆淆混淆淆淆混混淆混淆淆淆混混淆淆淆混淆混淆混淆混混淆淆淆混淆混混淆混混;)Z
    .registers 3

    instance-of v0, p1, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆淆混混淆混淆淆淆淆混混淆混混淆混混混混混混混淆淆混淆淆淆混淆淆淆淆淆淆淆淆混淆混淆淆混淆淆混混淆混淆混混混混淆淆淆淆混混混淆淆淆淆混淆混淆混混淆混淆淆淆淆混混淆混混淆混混淆淆混混混混混淆混混混;

    if-nez v0, :cond_0

    const/4 v0, 0x0

    :goto_0
    return v0

    :cond_0
    const/4 v0, 0x1

    goto :goto_0
.end method
