.class public final L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆淆混淆混淆淆淆混混淆混混淆淆混混混混混淆淆混淆混混淆混混淆混混淆淆淆混淆混混淆混混混混混混混混混淆淆淆淆混混淆淆混淆淆混混淆混淆混淆混混混淆淆淆淆淆淆淆淆混混混混淆混混混淆淆混混淆淆混混淆淆混;
.super L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆混淆淆混淆淆混混淆淆淆混淆淆淆淆混淆淆淆混混淆混淆混淆混混淆混混淆混混混淆淆淆淆混混混混淆淆淆混淆混淆淆淆混淆淆淆淆混淆淆淆混淆淆淆混混淆混淆淆淆混混淆淆淆混淆混淆混淆混混淆淆淆混淆混混淆混混;
.source "SourceFile"


# static fields
.field public static 淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆:[L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆淆混淆混淆淆淆混混淆混混淆淆混混混混混淆淆混淆混混淆混混淆混混淆淆淆混淆混混淆混混混混混混混混混淆淆淆淆混混淆淆混淆淆混混淆混淆混淆混混混淆淆淆淆淆淆淆淆混混混混淆混混混淆淆混混淆淆混混淆淆混;


# instance fields
.field public final 淆淆淆淆淆淆淆淆混淆淆混混混混混淆混混混混淆混混混混淆淆淆淆淆淆淆混混混淆混淆淆淆淆混混混混淆淆混淆混淆混淆混混混混混淆混淆淆混混混淆淆混淆淆混淆混混淆淆混淆混淆淆混淆混混混混混混混混淆混混淆淆淆混混:[B


# direct methods
.method public static constructor <clinit>()V
    .registers 1

    const/16 v0, 0xc

    new-array v0, v0, [L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆淆混淆混淆淆淆混混淆混混淆淆混混混混混淆淆混淆混混淆混混淆混混淆淆淆混淆混混淆混混混混混混混混混淆淆淆淆混混淆淆混淆淆混混淆混淆混淆混混混淆淆淆淆淆淆淆淆混混混混淆混混混淆淆混混淆淆混混淆淆混;

    sput-object v0, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆淆混淆混淆淆淆混混淆混混淆淆混混混混混淆淆混淆混混淆混混淆混混淆淆淆混淆混混淆混混混混混混混混混淆淆淆淆混混淆淆混淆淆混混淆混淆混淆混混混淆淆淆淆淆淆淆淆混混混混淆混混混淆淆混混淆淆混混淆淆混;->淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆:[L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆淆混淆混淆淆淆混混淆混混淆淆混混混混混淆淆混淆混混淆混混淆混混淆淆淆混淆混混淆混混混混混混混混混淆淆淆淆混混淆淆混淆淆混混淆混淆混淆混混混淆淆淆淆淆淆淆淆混混混混淆混混混淆淆混混淆淆混混淆淆混;

    return-void
.end method

.method public constructor <init>([B)V
    .registers 5

    const/4 v1, 0x0

    const/4 v2, 0x1

    invoke-direct {p0}, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆混淆淆混淆淆混混淆淆淆混淆淆淆淆混淆淆淆混混淆混淆混淆混混淆混混淆混混混淆淆淆淆混混混混淆淆淆混淆混淆淆淆混淆淆淆淆混淆淆淆混淆淆淆混混淆混淆淆淆混混淆淆淆混淆混淆混淆混混淆淆淆混淆混混淆混混;-><init>()V

    array-length v0, p1

    if-le v0, v2, :cond_1

    aget-byte v0, p1, v1

    if-nez v0, :cond_0

    aget-byte v0, p1, v2

    and-int/lit16 v0, v0, 0x80

    if-eqz v0, :cond_2

    :cond_0
    aget-byte v0, p1, v1

    const/4 v1, -0x1

    if-ne v0, v1, :cond_1

    aget-byte v0, p1, v2

    and-int/lit16 v0, v0, 0x80

    if-nez v0, :cond_3

    :cond_1
    invoke-static {p1}, L淆淆淆淆混淆混淆淆混淆混混淆混混淆混淆混混混混混混混淆淆混混混混淆混混混混混混淆混混混淆淆淆淆淆淆混淆混混淆混淆混混混混淆混混淆淆淆淆混混混淆混淆混淆混淆淆淆混淆混淆淆混淆淆淆混混混淆混淆淆淆淆混混淆/淆淆淆淆淆淆淆淆混淆淆混混混混混淆混混混混淆混混混混淆淆淆淆淆淆淆混混混淆混淆淆淆淆混混混混淆淆混淆混淆混淆混混混混混淆混淆淆混混混淆淆混淆淆混淆混混淆淆混淆混淆淆混淆混混混混混混混混淆混混淆淆淆混混;->淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆([B)[B

    move-result-object v0

    iput-object v0, p0, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆淆混淆混淆淆淆混混淆混混淆淆混混混混混淆淆混淆混混淆混混淆混混淆淆淆混淆混混淆混混混混混混混混混淆淆淆淆混混淆淆混淆淆混混淆混淆混淆混混混淆淆淆淆淆淆淆淆混混混混淆混混混淆淆混混淆淆混混淆淆混;->淆淆淆淆淆淆淆淆混淆淆混混混混混淆混混混混淆混混混混淆淆淆淆淆淆淆混混混淆混淆淆淆淆混混混混淆淆混淆混淆混淆混混混混混淆混淆淆混混混淆淆混淆淆混淆混混淆淆混淆混淆淆混淆混混混混混混混混淆混混淆淆淆混混:[B

    return-void

    :cond_2
    new-instance v0, Ljava/lang/IllegalArgumentException;

    const-string v1, "malformed enumerated"

    invoke-direct {v0, v1}, Ljava/lang/IllegalArgumentException;-><init>(Ljava/lang/String;)V

    throw v0

    :cond_3
    new-instance v0, Ljava/lang/IllegalArgumentException;

    const-string v1, "malformed enumerated"

    invoke-direct {v0, v1}, Ljava/lang/IllegalArgumentException;-><init>(Ljava/lang/String;)V

    throw v0
.end method


# virtual methods
.method public final hashCode()I
    .registers 2

    iget-object v0, p0, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆淆混淆混淆淆淆混混淆混混淆淆混混混混混淆淆混淆混混淆混混淆混混淆淆淆混淆混混淆混混混混混混混混混淆淆淆淆混混淆淆混淆淆混混淆混淆混淆混混混淆淆淆淆淆淆淆淆混混混混淆混混混淆淆混混淆淆混混淆淆混;->淆淆淆淆淆淆淆淆混淆淆混混混混混淆混混混混淆混混混混淆淆淆淆淆淆淆混混混淆混淆淆淆淆混混混混淆淆混淆混淆混淆混混混混混淆混淆淆混混混淆淆混淆淆混淆混混淆淆混淆混淆淆混淆混混混混混混混混淆混混淆淆淆混混:[B

    invoke-static {v0}, L淆淆淆淆混淆混淆淆混淆混混淆混混淆混淆混混混混混混混淆淆混混混混淆混混混混混混淆混混混淆淆淆淆淆淆混淆混混淆混淆混混混混淆混混淆淆淆淆混混混淆混淆混淆混淆淆淆混淆混淆淆混淆淆淆混混混淆混淆淆淆淆混混淆/淆淆淆淆淆淆淆淆混淆淆混混混混混淆混混混混淆混混混混淆淆淆淆淆淆淆混混混淆混淆淆淆淆混混混混淆淆混淆混淆混淆混混混混混淆混淆淆混混混淆淆混淆淆混淆混混淆淆混淆混淆淆混淆混混混混混混混混淆混混淆淆淆混混;->淆淆淆淆淆淆混淆淆混淆混混淆淆淆淆混混混混混淆淆淆淆淆混淆淆淆淆混混混混混混混淆淆淆淆混淆混混淆淆淆淆混混混淆混混淆淆淆淆混淆混混淆混淆淆淆淆混淆混淆淆混淆混淆淆淆混淆淆混淆混混淆淆混淆淆淆混混混混淆([B)I

    move-result v0

    return v0
.end method

.method public final 淆淆淆淆淆混淆混淆淆淆混混淆混混淆淆混混混混混淆淆混淆混混淆混混淆混混淆淆淆混淆混混淆混混混混混混混混混淆淆淆淆混混淆淆混淆淆混混淆混淆混淆混混混淆淆淆淆淆淆淆淆混混混混淆混混混淆淆混混淆淆混混淆淆混(L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆混淆淆混淆淆混混淆淆淆混淆淆淆淆混淆淆淆混混淆混淆混淆混混淆混混淆混混混淆淆淆淆混混混混淆淆淆混淆混淆淆淆混淆淆淆淆混淆淆淆混淆淆淆混混淆混淆淆淆混混淆淆淆混淆混淆混淆混混淆淆淆混淆混混淆混混;)Z
    .registers 4

    instance-of v0, p1, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆淆混淆混淆淆淆混混淆混混淆淆混混混混混淆淆混淆混混淆混混淆混混淆淆淆混淆混混淆混混混混混混混混混淆淆淆淆混混淆淆混淆淆混混淆混淆混淆混混混淆淆淆淆淆淆淆淆混混混混淆混混混淆淆混混淆淆混混淆淆混;

    if-nez v0, :cond_0

    const/4 v0, 0x0

    :goto_0
    return v0

    :cond_0
    check-cast p1, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆淆混淆混淆淆淆混混淆混混淆淆混混混混混淆淆混淆混混淆混混淆混混淆淆淆混淆混混淆混混混混混混混混混淆淆淆淆混混淆淆混淆淆混混淆混淆混淆混混混淆淆淆淆淆淆淆淆混混混混淆混混混淆淆混混淆淆混混淆淆混;

    iget-object v0, p0, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆淆混淆混淆淆淆混混淆混混淆淆混混混混混淆淆混淆混混淆混混淆混混淆淆淆混淆混混淆混混混混混混混混混淆淆淆淆混混淆淆混淆淆混混淆混淆混淆混混混淆淆淆淆淆淆淆淆混混混混淆混混混淆淆混混淆淆混混淆淆混;->淆淆淆淆淆淆淆淆混淆淆混混混混混淆混混混混淆混混混混淆淆淆淆淆淆淆混混混淆混淆淆淆淆混混混混淆淆混淆混淆混淆混混混混混淆混淆淆混混混淆淆混淆淆混淆混混淆淆混淆混淆淆混淆混混混混混混混混淆混混淆淆淆混混:[B

    iget-object v1, p1, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆淆混淆混淆淆淆混混淆混混淆淆混混混混混淆淆混淆混混淆混混淆混混淆淆淆混淆混混淆混混混混混混混混混淆淆淆淆混混淆淆混淆淆混混淆混淆混淆混混混淆淆淆淆淆淆淆淆混混混混淆混混混淆淆混混淆淆混混淆淆混;->淆淆淆淆淆淆淆淆混淆淆混混混混混淆混混混混淆混混混混淆淆淆淆淆淆淆混混混淆混淆淆淆淆混混混混淆淆混淆混淆混淆混混混混混淆混淆淆混混混淆淆混淆淆混淆混混淆淆混淆混淆淆混淆混混混混混混混混淆混混淆淆淆混混:[B

    invoke-static {v0, v1}, L淆淆淆淆混淆混淆淆混淆混混淆混混淆混淆混混混混混混混淆淆混混混混淆混混混混混混淆混混混淆淆淆淆淆淆混淆混混淆混淆混混混混淆混混淆淆淆淆混混混淆混淆混淆混淆淆淆混淆混淆淆混淆淆淆混混混淆混淆淆淆淆混混淆/淆淆淆淆淆淆淆淆混淆淆混混混混混淆混混混混淆混混混混淆淆淆淆淆淆淆混混混淆混淆淆淆淆混混混混淆淆混淆混淆混淆混混混混混淆混淆淆混混混淆淆混淆淆混淆混混淆淆混淆混淆淆混淆混混混混混混混混淆混混淆淆淆混混;->淆淆淆淆淆淆淆淆混淆淆混混混混混淆混混混混淆混混混混淆淆淆淆淆淆淆混混混淆混淆淆淆淆混混混混淆淆混淆混淆混淆混混混混混淆混淆淆混混混淆淆混淆淆混淆混混淆淆混淆混淆淆混淆混混混混混混混混淆混混淆淆淆混混([B[B)Z

    move-result v0

    goto :goto_0
.end method

.method public final 淆淆淆淆淆混淆混淆混淆淆淆混淆混淆淆淆淆淆混淆淆淆混淆淆淆淆淆混混淆混淆混淆混淆混混混淆混混混淆混混淆混混淆淆淆淆淆淆淆淆混淆混混淆混混混混混混混淆混淆混混混混淆混混混淆混混淆混淆淆淆混淆淆混淆淆淆淆(L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆混淆淆淆混混淆混淆混混淆淆淆淆混混混混混混淆混混淆混淆淆淆混混淆混混混淆混淆混混混淆混混混淆混淆混混混淆淆淆淆混混混混淆混淆混混淆混淆淆淆混淆混淆淆淆混淆混混混混淆淆混混淆混混淆淆混混淆混淆淆;)V
    .registers 4

    const/16 v0, 0xa

    iget-object v1, p0, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆淆混淆混淆淆淆混混淆混混淆淆混混混混混淆淆混淆混混淆混混淆混混淆淆淆混淆混混淆混混混混混混混混混淆淆淆淆混混淆淆混淆淆混混淆混淆混淆混混混淆淆淆淆淆淆淆淆混混混混淆混混混淆淆混混淆淆混混淆淆混;->淆淆淆淆淆淆淆淆混淆淆混混混混混淆混混混混淆混混混混淆淆淆淆淆淆淆混混混淆混淆淆淆淆混混混混淆淆混淆混淆混淆混混混混混淆混淆淆混混混淆淆混淆淆混淆混混淆淆混淆混淆淆混淆混混混混混混混混淆混混淆淆淆混混:[B

    invoke-virtual {p1, v0, v1}, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆混淆淆淆混混淆混淆混混淆淆淆淆混混混混混混淆混混淆混淆淆淆混混淆混混混淆混淆混混混淆混混混淆混淆混混混淆淆淆淆混混混混淆混淆混混淆混淆淆淆混淆混淆淆淆混淆混混混混淆淆混混淆混混淆淆混混淆混淆淆;->淆淆淆淆淆混淆淆混混混淆混混淆混混混淆混淆淆混淆淆混混混混混淆淆淆淆淆淆淆混混混淆淆淆淆淆淆淆混淆混淆混混混淆混淆混淆混混淆淆混混淆混淆淆淆混混混混淆混淆混混淆淆混淆淆淆淆淆淆混混淆混混混混淆淆淆混混(I[B)V

    return-void
.end method

.method public final 淆淆淆淆淆混混淆淆淆淆混混混淆混混混混淆混淆混混淆淆混混混淆淆混淆混淆混淆淆淆混混混淆淆混淆淆混淆淆淆混淆混淆淆淆淆混淆混混淆混混淆混混淆混混混混混淆混混混混混混淆淆淆混淆淆淆混淆混淆混混混淆混混混淆()I
    .registers 3

    iget-object v0, p0, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆淆混淆混淆淆淆混混淆混混淆淆混混混混混淆淆混淆混混淆混混淆混混淆淆淆混淆混混淆混混混混混混混混混淆淆淆淆混混淆淆混淆淆混混淆混淆混淆混混混淆淆淆淆淆淆淆淆混混混混淆混混混淆淆混混淆淆混混淆淆混;->淆淆淆淆淆淆淆淆混淆淆混混混混混淆混混混混淆混混混混淆淆淆淆淆淆淆混混混淆混淆淆淆淆混混混混淆淆混淆混淆混淆混混混混混淆混淆淆混混混淆淆混淆淆混淆混混淆淆混淆混淆淆混淆混混混混混混混混淆混混淆淆淆混混:[B

    array-length v0, v0

    invoke-static {v0}, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆混混淆混混混混混混淆淆混混淆混混淆淆淆淆淆淆混混淆混混混淆淆混淆混淆混混淆淆淆混混淆淆混淆淆淆淆淆淆淆淆淆淆淆混混混混混淆混淆淆淆淆混混混混混淆混淆混混淆淆淆淆淆混混混混淆混混淆混淆混淆混淆淆淆;->淆淆淆淆淆淆淆淆混淆淆混混混混混淆混混混混淆混混混混淆淆淆淆淆淆淆混混混淆混淆淆淆淆混混混混淆淆混淆混淆混淆混混混混混淆混淆淆混混混淆淆混淆淆混淆混混淆淆混淆混淆淆混淆混混混混混混混混淆混混淆淆淆混混(I)I

    move-result v0

    add-int/lit8 v0, v0, 0x1

    iget-object v1, p0, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆淆混淆混淆淆淆混混淆混混淆淆混混混混混淆淆混淆混混淆混混淆混混淆淆淆混淆混混淆混混混混混混混混混淆淆淆淆混混淆淆混淆淆混混淆混淆混淆混混混淆淆淆淆淆淆淆淆混混混混淆混混混淆淆混混淆淆混混淆淆混;->淆淆淆淆淆淆淆淆混淆淆混混混混混淆混混混混淆混混混混淆淆淆淆淆淆淆混混混淆混淆淆淆淆混混混混淆淆混淆混淆混淆混混混混混淆混淆淆混混混淆淆混淆淆混淆混混淆淆混淆混淆淆混淆混混混混混混混混淆混混淆淆淆混混:[B

    array-length v1, v1

    add-int/2addr v0, v1

    return v0
.end method

.method public final 淆淆淆淆淆混混淆淆混混混淆淆混混淆淆混混淆混混混混混淆淆混混混淆混淆混淆混混混淆淆淆淆混混淆混混淆混混淆混混混淆混混混淆混混混混混淆混淆混淆混淆淆混混淆混混淆混淆混淆混混淆淆混混混淆淆混混混淆混混淆淆()Z
    .registers 2

    const/4 v0, 0x0

    return v0
.end method
