.class public final L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆混混淆混混混淆混混混混淆混淆淆淆混淆淆混混淆混淆淆混淆淆淆混混淆淆淆淆淆混淆淆淆混淆淆混淆淆混淆混混混混混混混混淆混混混淆淆混混淆淆淆淆淆淆淆混混淆淆混淆淆混混淆混混淆淆淆混淆淆淆混混混淆混混;
.super L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆混淆淆淆淆混淆混淆混混淆淆淆混混混混混淆淆淆混混淆混混淆混淆淆混混混混淆混淆淆混淆淆淆淆淆混混混淆淆混淆混淆混淆混淆混混淆混混淆混混混淆混混混混混淆混混淆淆混混淆混混淆混淆混淆淆混混淆混淆混淆;
.source "SourceFile"


# instance fields
.field public 淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆:[L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆混淆淆淆淆混淆混淆混混淆淆淆混混混混混淆淆淆混混淆混混淆混淆淆混混混混淆混淆淆混淆淆淆淆淆混混混淆淆混淆混淆混淆混淆混混淆混混淆混混混淆混混混混混淆混混淆淆混混淆混混淆混淆混淆淆混混淆混淆混淆;


# direct methods
.method public constructor <init>([B)V
    .registers 2

    invoke-direct {p0, p1}, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆混淆淆淆淆混淆混淆混混淆淆淆混混混混混淆淆淆混混淆混混淆混淆淆混混混混淆混淆淆混淆淆淆淆淆混混混淆淆混淆混淆混淆混淆混混淆混混淆混混混淆混混混混混淆混混淆淆混混淆混混淆混淆混淆淆混混淆混淆混淆;-><init>([B)V

    return-void
.end method

.method public constructor <init>([L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆混淆淆淆淆混淆混淆混混淆淆淆混混混混混淆淆淆混混淆混混淆混淆淆混混混混淆混淆淆混淆淆淆淆淆混混混淆淆混淆混淆混淆混淆混混淆混混淆混混混淆混混混混混淆混混淆淆混混淆混混淆混淆混淆淆混混淆混淆混淆;)V
    .registers 5

    .line 1
    new-instance v2, Ljava/io/ByteArrayOutputStream;

    invoke-direct {v2}, Ljava/io/ByteArrayOutputStream;-><init>()V

    const/4 v0, 0x0

    move v1, v0

    :goto_0
    array-length v0, p1

    if-eq v1, v0, :cond_0

    :try_start_0
    aget-object v0, p1, v1

    check-cast v0, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆混淆混淆淆混淆淆淆混混混淆淆混淆淆混淆淆淆混混混混淆混混混淆淆混混混淆混混混混淆淆淆淆混混淆淆混淆混混混淆淆淆淆混淆淆混淆淆淆混淆混淆淆淆淆混混淆淆混淆淆淆淆混淆混混淆混混混淆淆淆淆混混混混淆淆;

    .line 2
    iget-object v0, v0, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆混淆淆淆淆混淆混淆混混淆淆淆混混混混混淆淆淆混混淆混混淆混淆淆混混混混淆混淆淆混淆淆淆淆淆混混混淆淆混淆混淆混淆混淆混混淆混混淆混混混淆混混混混混淆混混淆淆混混淆混混淆混淆混淆淆混混淆混淆混淆;->淆淆淆淆淆淆淆淆混淆淆混混混混混淆混混混混淆混混混混淆淆淆淆淆淆淆混混混淆混淆淆淆淆混混混混淆淆混淆混淆混淆混混混混混淆混淆淆混混混淆淆混淆淆混淆混混淆淆混淆混淆淆混淆混混混混混混混混淆混混淆淆淆混混:[B

    .line 3
    invoke-virtual {v2, v0}, Ljava/io/OutputStream;->write([B)V
    :try_end_0
    .catch Ljava/lang/ClassCastException; {:try_start_0 .. :try_end_0} :catch_1
    .catch Ljava/io/IOException; {:try_start_0 .. :try_end_0} :catch_0

    add-int/lit8 v0, v1, 0x1

    move v1, v0

    goto :goto_0

    :catch_0
    move-exception v0

    .line 4
    const-string v1, "exception converting octets "

    invoke-static {v1}, L淆淆淆淆淆淆淆淆混淆淆混混混混混淆混混混混淆混混混混淆淆淆淆淆淆淆混混混淆混淆淆淆淆混混混混淆淆混淆混淆混淆混混混混混淆混淆淆混混混淆淆混淆淆混淆混混淆淆混淆混淆淆混淆混混混混混混混混淆混混淆淆淆混混/淆淆淆淆淆淆淆淆混淆淆混混混混混淆混混混混淆混混混混淆淆淆淆淆淆淆混混混淆混淆淆淆淆混混混混淆淆混淆混淆混淆混混混混混淆混淆淆混混混淆淆混淆淆混淆混混淆淆混淆混淆淆混淆混混混混混混混混淆混混淆淆淆混混;->淆淆淆淆淆淆淆淆混淆淆混混混混混淆混混混混淆混混混混淆淆淆淆淆淆淆混混混淆混淆淆淆淆混混混混淆淆混淆混淆混淆混混混混混淆混淆淆混混混淆淆混淆淆混淆混混淆淆混淆混淆淆混淆混混混混混混混混淆混混淆淆淆混混(Ljava/lang/String;)Ljava/lang/StringBuilder;

    move-result-object v1

    .line 5
    invoke-virtual {v0}, Ljava/lang/Object;->toString()Ljava/lang/String;

    move-result-object v0

    invoke-virtual {v1, v0}, Ljava/lang/StringBuilder;->append(Ljava/lang/String;)Ljava/lang/StringBuilder;

    new-instance v0, Ljava/lang/IllegalArgumentException;

    invoke-virtual {v1}, Ljava/lang/StringBuilder;->toString()Ljava/lang/String;

    move-result-object v1

    invoke-direct {v0, v1}, Ljava/lang/IllegalArgumentException;-><init>(Ljava/lang/String;)V

    throw v0

    :catch_1
    move-exception v0

    new-instance v0, Ljava/lang/StringBuilder;

    invoke-direct {v0}, Ljava/lang/StringBuilder;-><init>()V

    aget-object v1, p1, v1

    invoke-virtual {v1}, Ljava/lang/Object;->getClass()Ljava/lang/Class;

    move-result-object v1

    invoke-virtual {v1}, Ljava/lang/Class;->getName()Ljava/lang/String;

    move-result-object v1

    invoke-virtual {v0, v1}, Ljava/lang/StringBuilder;->append(Ljava/lang/String;)Ljava/lang/StringBuilder;

    const-string v1, " found in input should only contain DEROctetString"

    invoke-virtual {v0, v1}, Ljava/lang/StringBuilder;->append(Ljava/lang/String;)Ljava/lang/StringBuilder;

    new-instance v1, Ljava/lang/IllegalArgumentException;

    invoke-virtual {v0}, Ljava/lang/StringBuilder;->toString()Ljava/lang/String;

    move-result-object v0

    invoke-direct {v1, v0}, Ljava/lang/IllegalArgumentException;-><init>(Ljava/lang/String;)V

    throw v1

    :cond_0
    invoke-virtual {v2}, Ljava/io/ByteArrayOutputStream;->toByteArray()[B

    move-result-object v0

    .line 6
    invoke-direct {p0, v0}, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆混淆淆淆淆混淆混淆混混淆淆淆混混混混混淆淆淆混混淆混混淆混淆淆混混混混淆混淆淆混淆淆淆淆淆混混混淆淆混淆混淆混淆混淆混混淆混混淆混混混淆混混混混混淆混混淆淆混混淆混混淆混淆混淆淆混混淆混淆混淆;-><init>([B)V

    iput-object p1, p0, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆混混淆混混混淆混混混混淆混淆淆淆混淆淆混混淆混淆淆混淆淆淆混混淆淆淆淆淆混淆淆淆混淆淆混淆淆混淆混混混混混混混混淆混混混淆淆混混淆淆淆淆淆淆淆混混淆淆混淆淆混混淆混混淆淆淆混淆淆淆混混混淆混混;->淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆:[L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆混淆淆淆淆混淆混淆混混淆淆淆混混混混混淆淆淆混混淆混混淆混淆淆混混混混淆混淆淆混淆淆淆淆淆混混混淆淆混淆混淆混淆混淆混混淆混混淆混混混淆混混混混混淆混混淆淆混混淆混混淆混淆混淆淆混混淆混淆混淆;

    return-void
.end method


# virtual methods
.method public final 淆淆淆淆淆混淆混淆混淆淆淆混淆混淆淆淆淆淆混淆淆淆混淆淆淆淆淆混混淆混淆混淆混淆混混混淆混混混淆混混淆混混淆淆淆淆淆淆淆淆混淆混混淆混混混混混混混淆混淆混混混混淆混混混淆混混淆混淆淆淆混淆淆混淆淆淆淆(L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆混淆淆淆混混淆混淆混混淆淆淆淆混混混混混混淆混混淆混淆淆淆混混淆混混混淆混淆混混混淆混混混淆混淆混混混淆淆淆淆混混混混淆混淆混混淆混淆淆淆混淆混淆淆淆混淆混混混混淆淆混混淆混混淆淆混混淆混淆淆;)V
    .registers 5

    const/4 v2, 0x0

    const/16 v0, 0x24

    invoke-virtual {p1, v0}, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆混淆淆淆混混淆混淆混混淆淆淆淆混混混混混混淆混混淆混淆淆淆混混淆混混混淆混淆混混混淆混混混淆混淆混混混淆淆淆淆混混混混淆混淆混混淆混淆淆淆混淆混淆淆淆混淆混混混混淆淆混混淆混混淆淆混混淆混淆淆;->淆淆淆淆淆淆混淆淆混淆混混淆淆淆淆混混混混混淆淆淆淆淆混淆淆淆淆混混混混混混混淆淆淆淆混淆混混淆淆淆淆混混混淆混混淆淆淆淆混淆混混淆混淆淆淆淆混淆混淆淆混淆混淆淆淆混淆淆混淆混混淆淆混淆淆淆混混混混淆(I)V

    const/16 v0, 0x80

    invoke-virtual {p1, v0}, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆混淆淆淆混混淆混淆混混淆淆淆淆混混混混混混淆混混淆混淆淆淆混混淆混混混淆混淆混混混淆混混混淆混淆混混混淆淆淆淆混混混混淆混淆混混淆混淆淆淆混淆混淆淆淆混淆混混混混淆淆混混淆混混淆淆混混淆混淆淆;->淆淆淆淆淆淆混淆淆混淆混混淆淆淆淆混混混混混淆淆淆淆淆混淆淆淆淆混混混混混混混淆淆淆淆混淆混混淆淆淆淆混混混淆混混淆淆淆淆混淆混混淆混淆淆淆淆混淆混淆淆混淆混淆淆淆混淆淆混淆混混淆淆混淆淆淆混混混混淆(I)V

    invoke-virtual {p0}, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆混混淆混混混淆混混混混淆混淆淆淆混淆淆混混淆混淆淆混淆淆淆混混淆淆淆淆淆混淆淆淆混淆淆混淆淆混淆混混混混混混混混淆混混混淆淆混混淆淆淆淆淆淆淆混混淆淆混淆淆混混淆混混淆淆淆混淆淆淆混混混淆混混;->淆淆淆淆混淆淆淆混淆混淆混淆淆混混淆混淆混淆淆淆混淆混混淆淆混淆混混混淆混混混淆淆淆混混混混淆淆混淆淆混淆混混淆混混混混淆淆淆混混淆混混混淆淆混混混淆淆混混淆淆混混淆混混淆淆淆淆淆淆淆混混混混淆淆混混()Ljava/util/Enumeration;

    move-result-object v1

    :goto_0
    invoke-interface {v1}, Ljava/util/Enumeration;->hasMoreElements()Z

    move-result v0

    if-eqz v0, :cond_0

    invoke-interface {v1}, Ljava/util/Enumeration;->nextElement()Ljava/lang/Object;

    move-result-object v0

    check-cast v0, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆淆淆混淆混混混混混混淆混淆淆淆混淆淆淆淆淆淆混混混混淆淆混淆淆混混混淆混混淆淆混淆混淆淆混淆淆混混混淆淆混淆混混淆混混淆混淆淆淆混混淆混混淆混混混淆淆淆淆淆淆淆混淆淆淆混淆混淆淆淆淆淆淆混混混;

    invoke-virtual {p1, v0}, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆混淆淆淆混混淆混淆混混淆淆淆淆混混混混混混淆混混淆混淆淆淆混混淆混混混淆混淆混混混淆混混混淆混淆混混混淆淆淆淆混混混混淆混淆混混淆混淆淆淆混淆混淆淆淆混淆混混混混淆淆混混淆混混淆淆混混淆混淆淆;->淆淆淆淆淆混混淆淆淆淆混混混淆混混混混淆混淆混混淆淆混混混淆淆混淆混淆混淆淆淆混混混淆淆混淆淆混淆淆淆混淆混淆淆淆淆混淆混混淆混混淆混混淆混混混混混淆混混混混混混淆淆淆混淆淆淆混淆混淆混混混淆混混混淆(L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆淆淆混淆混混混混混混淆混淆淆淆混淆淆淆淆淆淆混混混混淆淆混淆淆混混混淆混混淆淆混淆混淆淆混淆淆混混混淆淆混淆混混淆混混淆混淆淆淆混混淆混混淆混混混淆淆淆淆淆淆淆混淆淆淆混淆混淆淆淆淆淆淆混混混;)V

    goto :goto_0

    :cond_0
    invoke-virtual {p1, v2}, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆混淆淆淆混混淆混淆混混淆淆淆淆混混混混混混淆混混淆混淆淆淆混混淆混混混淆混淆混混混淆混混混淆混淆混混混淆淆淆淆混混混混淆混淆混混淆混淆淆淆混淆混淆淆淆混淆混混混混淆淆混混淆混混淆淆混混淆混淆淆;->淆淆淆淆淆淆混淆淆混淆混混淆淆淆淆混混混混混淆淆淆淆淆混淆淆淆淆混混混混混混混淆淆淆淆混淆混混淆淆淆淆混混混淆混混淆淆淆淆混淆混混淆混淆淆淆淆混淆混淆淆混淆混淆淆淆混淆淆混淆混混淆淆混淆淆淆混混混混淆(I)V

    invoke-virtual {p1, v2}, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆混淆淆淆混混淆混淆混混淆淆淆淆混混混混混混淆混混淆混淆淆淆混混淆混混混淆混淆混混混淆混混混淆混淆混混混淆淆淆淆混混混混淆混淆混混淆混淆淆淆混淆混淆淆淆混淆混混混混淆淆混混淆混混淆淆混混淆混淆淆;->淆淆淆淆淆淆混淆淆混淆混混淆淆淆淆混混混混混淆淆淆淆淆混淆淆淆淆混混混混混混混淆淆淆淆混淆混混淆淆淆淆混混混淆混混淆淆淆淆混淆混混淆混淆淆淆淆混淆混淆淆混淆混淆淆淆混淆淆混淆混混淆淆混淆淆淆混混混混淆(I)V

    return-void
.end method

.method public final 淆淆淆淆淆混混淆淆淆淆混混混淆混混混混淆混淆混混淆淆混混混淆淆混淆混淆混淆淆淆混混混淆淆混淆淆混淆淆淆混淆混淆淆淆淆混淆混混淆混混淆混混淆混混混混混淆混混混混混混淆淆淆混淆淆淆混淆混淆混混混淆混混混淆()I
    .registers 4

    invoke-virtual {p0}, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆混混淆混混混淆混混混混淆混淆淆淆混淆淆混混淆混淆淆混淆淆淆混混淆淆淆淆淆混淆淆淆混淆淆混淆淆混淆混混混混混混混混淆混混混淆淆混混淆淆淆淆淆淆淆混混淆淆混淆淆混混淆混混淆淆淆混淆淆淆混混混淆混混;->淆淆淆淆混淆淆淆混淆混淆混淆淆混混淆混淆混淆淆淆混淆混混淆淆混淆混混混淆混混混淆淆淆混混混混淆淆混淆淆混淆混混淆混混混混淆淆淆混混淆混混混淆淆混混混淆淆混混淆淆混混淆混混淆淆淆淆淆淆淆混混混混淆淆混混()Ljava/util/Enumeration;

    move-result-object v2

    const/4 v0, 0x0

    move v1, v0

    :goto_0
    invoke-interface {v2}, Ljava/util/Enumeration;->hasMoreElements()Z

    move-result v0

    if-eqz v0, :cond_0

    invoke-interface {v2}, Ljava/util/Enumeration;->nextElement()Ljava/lang/Object;

    move-result-object v0

    check-cast v0, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆淆淆混淆混混混混混混淆混淆淆淆混淆淆淆淆淆淆混混混混淆淆混淆淆混混混淆混混淆淆混淆混淆淆混淆淆混混混淆淆混淆混混淆混混淆混淆淆淆混混淆混混淆混混混淆淆淆淆淆淆淆混淆淆淆混淆混淆淆淆淆淆淆混混混;

    invoke-interface {v0}, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆淆淆混淆混混混混混混淆混淆淆淆混淆淆淆淆淆淆混混混混淆淆混淆淆混混混淆混混淆淆混淆混淆淆混淆淆混混混淆淆混淆混混淆混混淆混淆淆淆混混淆混混淆混混混淆淆淆淆淆淆淆混淆淆淆混淆混淆淆淆淆淆淆混混混;->淆淆淆淆淆淆混淆混混混淆淆淆淆混淆淆混淆淆混混淆淆混混混淆淆淆淆淆淆混淆混淆混混混混混混混混混淆混混混淆混混混混混淆混淆混混淆淆混淆淆淆混淆混淆淆淆混混淆混混淆淆混混淆淆混淆淆淆淆淆混淆淆混混淆混混混()L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆混淆淆混淆淆混混淆淆淆混淆淆淆淆混淆淆淆混混淆混淆混淆混混淆混混淆混混混淆淆淆淆混混混混淆淆淆混淆混淆淆淆混淆淆淆淆混淆淆淆混淆淆淆混混淆混淆淆淆混混淆淆淆混淆混淆混淆混混淆淆淆混淆混混淆混混;

    move-result-object v0

    invoke-virtual {v0}, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆混淆淆混淆淆混混淆淆淆混淆淆淆淆混淆淆淆混混淆混淆混淆混混淆混混淆混混混淆淆淆淆混混混混淆淆淆混淆混淆淆淆混淆淆淆淆混淆淆淆混淆淆淆混混淆混淆淆淆混混淆淆淆混淆混淆混淆混混淆淆淆混淆混混淆混混;->淆淆淆淆淆混混淆淆淆淆混混混淆混混混混淆混淆混混淆淆混混混淆淆混淆混淆混淆淆淆混混混淆淆混淆淆混淆淆淆混淆混淆淆淆淆混淆混混淆混混淆混混淆混混混混混淆混混混混混混淆淆淆混淆淆淆混淆混淆混混混淆混混混淆()I

    move-result v0

    add-int/2addr v0, v1

    move v1, v0

    goto :goto_0

    :cond_0
    add-int/lit8 v0, v1, 0x2

    add-int/lit8 v0, v0, 0x2

    return v0
.end method

.method public final 淆淆淆淆淆混混淆淆混混混淆淆混混淆淆混混淆混混混混混淆淆混混混淆混淆混淆混混混淆淆淆淆混混淆混混淆混混淆混混混淆混混混淆混混混混混淆混淆混淆混淆淆混混淆混混淆混淆混淆混混淆淆混混混淆淆混混混淆混混淆淆()Z
    .registers 2

    const/4 v0, 0x1

    return v0
.end method

.method public final 淆淆淆淆混淆淆淆淆混淆混淆混混淆淆淆混混混混混淆淆淆混混淆混混淆混淆淆混混混混淆混淆淆混淆淆淆淆淆混混混淆淆混淆混淆混淆混淆混混淆混混淆混混混淆混混混混混淆混混淆淆混混淆混混淆混淆混淆淆混混淆混淆混淆()[B
    .registers 2

    iget-object v0, p0, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆混淆淆淆淆混淆混淆混混淆淆淆混混混混混淆淆淆混混淆混混淆混淆淆混混混混淆混淆淆混淆淆淆淆淆混混混淆淆混淆混淆混淆混淆混混淆混混淆混混混淆混混混混混淆混混淆淆混混淆混混淆混淆混淆淆混混淆混淆混淆;->淆淆淆淆淆淆淆淆混淆淆混混混混混淆混混混混淆混混混混淆淆淆淆淆淆淆混混混淆混淆淆淆淆混混混混淆淆混淆混淆混淆混混混混混淆混淆淆混混混淆淆混淆淆混淆混混淆淆混淆混淆淆混淆混混混混混混混混淆混混淆淆淆混混:[B

    return-object v0
.end method

.method public final 淆淆淆淆混淆淆淆混淆混淆混淆淆混混淆混淆混淆淆淆混淆混混淆淆混淆混混混淆混混混淆淆淆混混混混淆淆混淆淆混淆混混淆混混混混淆淆淆混混淆混混混淆淆混混混淆淆混混淆淆混混淆混混淆淆淆淆淆淆淆混混混混淆淆混混()Ljava/util/Enumeration;
    .registers 8

    const/4 v1, 0x0

    iget-object v0, p0, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆混混淆混混混淆混混混混淆混淆淆淆混淆淆混混淆混淆淆混淆淆淆混混淆淆淆淆淆混淆淆淆混淆淆混淆淆混淆混混混混混混混混淆混混混淆淆混混淆淆淆淆淆淆淆混混淆淆混淆淆混混淆混混淆淆淆混淆淆淆混混混淆混混;->淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆:[L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆混淆淆淆淆混淆混淆混混淆淆淆混混混混混淆淆淆混混淆混混淆混淆淆混混混混淆混淆淆混淆淆淆淆淆混混混淆淆混淆混淆混淆混淆混混淆混混淆混混混淆混混混混混淆混混淆淆混混淆混混淆混淆混淆淆混混淆混淆混淆;

    if-nez v0, :cond_2

    .line 1
    new-instance v4, Ljava/util/Vector;

    invoke-direct {v4}, Ljava/util/Vector;-><init>()V

    move v0, v1

    :goto_0
    iget-object v5, p0, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆混淆淆淆淆混淆混淆混混淆淆淆混混混混混淆淆淆混混淆混混淆混淆淆混混混混淆混淆淆混淆淆淆淆淆混混混淆淆混淆混淆混淆混淆混混淆混混淆混混混淆混混混混混淆混混淆淆混混淆混混淆混淆混淆淆混混淆混淆混淆;->淆淆淆淆淆淆淆淆混淆淆混混混混混淆混混混混淆混混混混淆淆淆淆淆淆淆混混混淆混淆淆淆淆混混混混淆淆混淆混淆混淆混混混混混淆混淆淆混混混淆淆混淆淆混淆混混淆淆混淆混淆淆混淆混混混混混混混混淆混混淆淆淆混混:[B

    array-length v2, v5

    if-ge v0, v2, :cond_1

    add-int/lit16 v2, v0, 0x3e8

    array-length v3, v5

    if-le v2, v3, :cond_0

    array-length v3, v5

    :goto_1
    sub-int/2addr v3, v0

    new-array v6, v3, [B

    invoke-static {v5, v0, v6, v1, v3}, Ljava/lang/System;->arraycopy(Ljava/lang/Object;ILjava/lang/Object;II)V

    new-instance v0, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆混淆混淆淆混淆淆淆混混混淆淆混淆淆混淆淆淆混混混混淆混混混淆淆混混混淆混混混混淆淆淆淆混混淆淆混淆混混混淆淆淆淆混淆淆混淆淆淆混淆混淆淆淆淆混混淆淆混淆淆淆淆混淆混混淆混混混淆淆淆淆混混混混淆淆;

    invoke-direct {v0, v6}, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆混淆混淆淆混淆淆淆混混混淆淆混淆淆混淆淆淆混混混混淆混混混淆淆混混混淆混混混混淆淆淆淆混混淆淆混淆混混混淆淆淆淆混淆淆混淆淆淆混淆混淆淆淆淆混混淆淆混淆淆淆淆混淆混混淆混混混淆淆淆淆混混混混淆淆;-><init>([B)V

    invoke-virtual {v4, v0}, Ljava/util/Vector;->addElement(Ljava/lang/Object;)V

    move v0, v2

    goto :goto_0

    :cond_0
    move v3, v2

    goto :goto_1

    .line 2
    :cond_1
    invoke-virtual {v4}, Ljava/util/Vector;->elements()Ljava/util/Enumeration;

    move-result-object v0

    :goto_2
    return-object v0

    :cond_2
    new-instance v0, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆混混淆混混混淆混混混混淆混淆淆淆混淆淆混混淆混淆淆混淆淆淆混混淆淆淆淆淆混淆淆淆混淆淆混淆淆混淆混混混混混混混混淆混混混淆淆混混淆淆淆淆淆淆淆混混淆淆混淆淆混混淆混混淆淆淆混淆淆淆混混混淆混混$淆淆淆淆淆淆淆淆混淆淆混混混混混淆混混混混淆混混混混淆淆淆淆淆淆淆混混混淆混淆淆淆淆混混混混淆淆混淆混淆混淆混混混混混淆混淆淆混混混淆淆混淆淆混淆混混淆淆混淆混淆淆混淆混混混混混混混混淆混混淆淆淆混混;

    invoke-direct {v0, p0}, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆混混淆混混混淆混混混混淆混淆淆淆混淆淆混混淆混淆淆混淆淆淆混混淆淆淆淆淆混淆淆淆混淆淆混淆淆混淆混混混混混混混混淆混混混淆淆混混淆淆淆淆淆淆淆混混淆淆混淆淆混混淆混混淆淆淆混淆淆淆混混混淆混混$淆淆淆淆淆淆淆淆混淆淆混混混混混淆混混混混淆混混混混淆淆淆淆淆淆淆混混混淆混淆淆淆淆混混混混淆淆混淆混淆混淆混混混混混淆混淆淆混混混淆淆混淆淆混淆混混淆淆混淆混淆淆混淆混混混混混混混混淆混混淆淆淆混混;-><init>(L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆混混淆混混混淆混混混混淆混淆淆淆混淆淆混混淆混淆淆混淆淆淆混混淆淆淆淆淆混淆淆淆混淆淆混淆淆混淆混混混混混混混混淆混混混淆淆混混淆淆淆淆淆淆淆混混淆淆混淆淆混混淆混混淆淆淆混淆淆淆混混混淆混混;)V

    goto :goto_2
.end method
