.class public L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆混淆淆淆混混淆混淆混混淆淆淆淆混混混混混混淆混混淆混淆淆淆混混淆混混混淆混淆混混混淆混混混淆混淆混混混淆淆淆淆混混混混淆混淆混混淆混淆淆淆混淆混淆淆淆混淆混混混混淆淆混混淆混混淆淆混混淆混淆淆;
.super Ljava/lang/Object;
.source "SourceFile"


# annotations
.annotation system Ldalvik/annotation/MemberClasses;
    value = {
        L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆混淆淆淆混混淆混淆混混淆淆淆淆混混混混混混淆混混淆混淆淆淆混混淆混混混淆混淆混混混淆混混混淆混淆混混混淆淆淆淆混混混混淆混淆混混淆混淆淆淆混淆混淆淆淆混淆混混混混淆淆混混淆混混淆淆混混淆混淆淆$淆淆淆淆淆淆淆淆混淆淆混混混混混淆混混混混淆混混混混淆淆淆淆淆淆淆混混混淆混淆淆淆淆混混混混淆淆混淆混淆混淆混混混混混淆混淆淆混混混淆淆混淆淆混淆混混淆淆混淆混淆淆混淆混混混混混混混混淆混混淆淆淆混混;
    }
.end annotation


# instance fields
.field public 淆淆淆淆淆淆淆淆混淆淆混混混混混淆混混混混淆混混混混淆淆淆淆淆淆淆混混混淆混淆淆淆淆混混混混淆淆混淆混淆混淆混混混混混淆混淆淆混混混淆淆混淆淆混淆混混淆淆混淆混淆淆混淆混混混混混混混混淆混混淆淆淆混混:Ljava/io/OutputStream;


# direct methods
.method public constructor <init>(Ljava/io/OutputStream;)V
    .registers 2

    invoke-direct {p0}, Ljava/lang/Object;-><init>()V

    iput-object p1, p0, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆混淆淆淆混混淆混淆混混淆淆淆淆混混混混混混淆混混淆混淆淆淆混混淆混混混淆混淆混混混淆混混混淆混淆混混混淆淆淆淆混混混混淆混淆混混淆混淆淆淆混淆混淆淆淆混淆混混混混淆淆混混淆混混淆淆混混淆混淆淆;->淆淆淆淆淆淆淆淆混淆淆混混混混混淆混混混混淆混混混混淆淆淆淆淆淆淆混混混淆混淆淆淆淆混混混混淆淆混淆混淆混淆混混混混混淆混淆淆混混混淆淆混淆淆混淆混混淆淆混淆混淆淆混淆混混混混混混混混淆混混淆淆淆混混:Ljava/io/OutputStream;

    return-void
.end method


# virtual methods
.method public 淆淆淆淆淆淆淆淆混淆淆混混混混混淆混混混混淆混混混混淆淆淆淆淆淆淆混混混淆混淆淆淆淆混混混混淆淆混淆混淆混淆混混混混混淆混淆淆混混混淆淆混淆淆混淆混混淆淆混淆混淆淆混淆混混混混混混混混淆混混淆淆淆混混()L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆混淆淆淆混混淆混淆混混淆淆淆淆混混混混混混淆混混淆混淆淆淆混混淆混混混淆混淆混混混淆混混混淆混淆混混混淆淆淆淆混混混混淆混淆混混淆混淆淆淆混淆混淆淆淆混淆混混混混淆淆混混淆混混淆淆混混淆混淆淆;
    .registers 4

    new-instance v0, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆混淆混淆淆混混混混淆混混淆淆淆淆淆淆淆淆混淆混淆淆淆混混淆混淆混淆淆混混淆混淆淆混混淆淆淆淆淆混混混淆淆混混混淆混混混淆淆淆混混混淆淆淆淆淆混淆淆淆混淆淆混淆淆淆混淆混淆淆淆淆混混混混淆淆淆混淆;

    iget-object v1, p0, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆混淆淆淆混混淆混淆混混淆淆淆淆混混混混混混淆混混淆混淆淆淆混混淆混混混淆混淆混混混淆混混混淆混淆混混混淆淆淆淆混混混混淆混淆混混淆混淆淆淆混淆混淆淆淆混淆混混混混淆淆混混淆混混淆淆混混淆混淆淆;->淆淆淆淆淆淆淆淆混淆淆混混混混混淆混混混混淆混混混混淆淆淆淆淆淆淆混混混淆混淆淆淆淆混混混混淆淆混淆混淆混淆混混混混混淆混淆淆混混混淆淆混淆淆混淆混混淆淆混淆混淆淆混淆混混混混混混混混淆混混淆淆淆混混:Ljava/io/OutputStream;

    const/4 v2, 0x0

    invoke-direct {v0, v1, v2}, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆混淆混淆淆混混混混淆混混淆淆淆淆淆淆淆淆混淆混淆淆淆混混淆混淆混淆淆混混淆混淆淆混混淆淆淆淆淆混混混淆淆混混混淆混混混淆淆淆混混混淆淆淆淆淆混淆淆淆混淆淆混淆淆淆混淆混淆淆淆淆混混混混淆淆淆混淆;-><init>(Ljava/io/OutputStream;I)V

    return-object v0
.end method

.method public 淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆()L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆混淆淆淆混混淆混淆混混淆淆淆淆混混混混混混淆混混淆混淆淆淆混混淆混混混淆混淆混混混淆混混混淆混淆混混混淆淆淆淆混混混混淆混淆混混淆混淆淆淆混淆混淆淆淆混淆混混混混淆淆混混淆混混淆淆混混淆混淆淆;
    .registers 4

    new-instance v0, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆混淆混淆淆混混混混淆混混淆淆淆淆淆淆淆淆混淆混淆淆淆混混淆混淆混淆淆混混淆混淆淆混混淆淆淆淆淆混混混淆淆混混混淆混混混淆淆淆混混混淆淆淆淆淆混淆淆淆混淆淆混淆淆淆混淆混淆淆淆淆混混混混淆淆淆混淆;

    iget-object v1, p0, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆混淆淆淆混混淆混淆混混淆淆淆淆混混混混混混淆混混淆混淆淆淆混混淆混混混淆混淆混混混淆混混混淆混淆混混混淆淆淆淆混混混混淆混淆混混淆混淆淆淆混淆混淆淆淆混淆混混混混淆淆混混淆混混淆淆混混淆混淆淆;->淆淆淆淆淆淆淆淆混淆淆混混混混混淆混混混混淆混混混混淆淆淆淆淆淆淆混混混淆混淆淆淆淆混混混混淆淆混淆混淆混淆混混混混混淆混淆淆混混混淆淆混淆淆混淆混混淆淆混淆混淆淆混淆混混混混混混混混淆混混淆淆淆混混:Ljava/io/OutputStream;

    const/4 v2, 0x1

    invoke-direct {v0, v1, v2}, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆混淆混淆淆混混混混淆混混淆淆淆淆淆淆淆淆混淆混淆淆淆混混淆混淆混淆淆混混淆混淆淆混混淆淆淆淆淆混混混淆淆混混混淆混混混淆淆淆混混混淆淆淆淆淆混淆淆淆混淆淆混淆淆淆混淆混淆淆淆淆混混混混淆淆淆混淆;-><init>(Ljava/io/OutputStream;I)V

    return-object v0
.end method

.method public 淆淆淆淆淆淆混淆淆混淆混混淆淆淆淆混混混混混淆淆淆淆淆混淆淆淆淆混混混混混混混淆淆淆淆混淆混混淆淆淆淆混混混淆混混淆淆淆淆混淆混混淆混淆淆淆淆混淆混淆淆混淆混淆淆淆混淆淆混淆混混淆淆混淆淆淆混混混混淆(I)V
    .registers 3

    iget-object v0, p0, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆混淆淆淆混混淆混淆混混淆淆淆淆混混混混混混淆混混淆混淆淆淆混混淆混混混淆混淆混混混淆混混混淆混淆混混混淆淆淆淆混混混混淆混淆混混淆混淆淆淆混淆混淆淆淆混淆混混混混淆淆混混淆混混淆淆混混淆混淆淆;->淆淆淆淆淆淆淆淆混淆淆混混混混混淆混混混混淆混混混混淆淆淆淆淆淆淆混混混淆混淆淆淆淆混混混混淆淆混淆混淆混淆混混混混混淆混淆淆混混混淆淆混淆淆混淆混混淆淆混淆混淆淆混淆混混混混混混混混淆混混淆淆淆混混:Ljava/io/OutputStream;

    invoke-virtual {v0, p1}, Ljava/io/OutputStream;->write(I)V

    return-void
.end method

.method public final 淆淆淆淆淆淆混淆混混混淆淆淆淆混淆淆混淆淆混混淆淆混混混淆淆淆淆淆淆混淆混淆混混混混混混混混混淆混混混淆混混混混混淆混淆混混淆淆混淆淆淆混淆混淆淆淆混混淆混混淆淆混混淆淆混淆淆淆淆淆混淆淆混混淆混混混([B)V
    .registers 3

    iget-object v0, p0, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆混淆淆淆混混淆混淆混混淆淆淆淆混混混混混混淆混混淆混淆淆淆混混淆混混混淆混淆混混混淆混混混淆混淆混混混淆淆淆淆混混混混淆混淆混混淆混淆淆淆混淆混淆淆淆混淆混混混混淆淆混混淆混混淆淆混混淆混淆淆;->淆淆淆淆淆淆淆淆混淆淆混混混混混淆混混混混淆混混混混淆淆淆淆淆淆淆混混混淆混淆淆淆淆混混混混淆淆混淆混淆混淆混混混混混淆混淆淆混混混淆淆混淆淆混淆混混淆淆混淆混淆淆混淆混混混混混混混混淆混混淆淆淆混混:Ljava/io/OutputStream;

    invoke-virtual {v0, p1}, Ljava/io/OutputStream;->write([B)V

    return-void
.end method

.method public final 淆淆淆淆淆淆混淆混混混混混混淆混淆淆淆混淆淆淆淆淆淆混混混混淆淆混淆淆混混混淆混混淆淆混淆混淆淆混淆淆混混混淆淆混淆混混淆混混淆混淆淆淆混混淆混混淆混混混淆淆淆淆淆淆淆混淆淆淆混淆混淆淆淆淆淆淆混混混(II[B)V
    .registers 5

    invoke-virtual {p0, p1, p2}, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆混淆淆淆混混淆混淆混混淆淆淆淆混混混混混混淆混混淆混淆淆淆混混淆混混混淆混淆混混混淆混混混淆混淆混混混淆淆淆淆混混混混淆混淆混混淆混淆淆淆混淆混淆淆淆混淆混混混混淆淆混混淆混混淆淆混混淆混淆淆;->淆淆淆淆淆混混淆淆混淆混淆淆淆混混淆淆混淆混混淆淆淆混淆淆淆淆混混淆淆混淆淆淆淆淆淆淆淆混淆混混淆淆混淆混淆淆混淆淆淆淆淆混混淆混淆淆混混淆淆淆淆混混混淆混淆混混淆淆混淆淆淆混混混混淆淆混淆淆淆淆淆混(II)V

    array-length v0, p3

    invoke-virtual {p0, v0}, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆混淆淆淆混混淆混淆混混淆淆淆淆混混混混混混淆混混淆混淆淆淆混混淆混混混淆混淆混混混淆混混混淆混淆混混混淆淆淆淆混混混混淆混淆混混淆混淆淆淆混淆混淆淆淆混淆混混混混淆淆混混淆混混淆淆混混淆混淆淆;->淆淆淆淆淆混淆混淆混淆淆淆混淆混淆淆淆淆淆混淆淆淆混淆淆淆淆淆混混淆混淆混淆混淆混混混淆混混混淆混混淆混混淆淆淆淆淆淆淆淆混淆混混淆混混混混混混混淆混淆混混混混淆混混混淆混混淆混淆淆淆混淆淆混淆淆淆淆(I)V

    invoke-virtual {p0, p3}, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆混淆淆淆混混淆混淆混混淆淆淆淆混混混混混混淆混混淆混淆淆淆混混淆混混混淆混淆混混混淆混混混淆混淆混混混淆淆淆淆混混混混淆混淆混混淆混淆淆淆混淆混淆淆淆混淆混混混混淆淆混混淆混混淆淆混混淆混淆淆;->淆淆淆淆淆淆混淆混混混淆淆淆淆混淆淆混淆淆混混淆淆混混混淆淆淆淆淆淆混淆混淆混混混混混混混混混淆混混混淆混混混混混淆混淆混混淆淆混淆淆淆混淆混淆淆淆混混淆混混淆淆混混淆淆混淆淆淆淆淆混淆淆混混淆混混混([B)V

    return-void
.end method

.method public final 淆淆淆淆淆混淆淆混混混淆混混淆混混混淆混淆淆混淆淆混混混混混淆淆淆淆淆淆淆混混混淆淆淆淆淆淆淆混淆混淆混混混淆混淆混淆混混淆淆混混淆混淆淆淆混混混混淆混淆混混淆淆混淆淆淆淆淆淆混混淆混混混混淆淆淆混混(I[B)V
    .registers 4

    invoke-virtual {p0, p1}, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆混淆淆淆混混淆混淆混混淆淆淆淆混混混混混混淆混混淆混淆淆淆混混淆混混混淆混淆混混混淆混混混淆混淆混混混淆淆淆淆混混混混淆混淆混混淆混淆淆淆混淆混淆淆淆混淆混混混混淆淆混混淆混混淆淆混混淆混淆淆;->淆淆淆淆淆淆混淆淆混淆混混淆淆淆淆混混混混混淆淆淆淆淆混淆淆淆淆混混混混混混混淆淆淆淆混淆混混淆淆淆淆混混混淆混混淆淆淆淆混淆混混淆混淆淆淆淆混淆混淆淆混淆混淆淆淆混淆淆混淆混混淆淆混淆淆淆混混混混淆(I)V

    array-length v0, p2

    invoke-virtual {p0, v0}, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆混淆淆淆混混淆混淆混混淆淆淆淆混混混混混混淆混混淆混淆淆淆混混淆混混混淆混淆混混混淆混混混淆混淆混混混淆淆淆淆混混混混淆混淆混混淆混淆淆淆混淆混淆淆淆混淆混混混混淆淆混混淆混混淆淆混混淆混淆淆;->淆淆淆淆淆混淆混淆混淆淆淆混淆混淆淆淆淆淆混淆淆淆混淆淆淆淆淆混混淆混淆混淆混淆混混混淆混混混淆混混淆混混淆淆淆淆淆淆淆淆混淆混混淆混混混混混混混淆混淆混混混混淆混混混淆混混淆混淆淆淆混淆淆混淆淆淆淆(I)V

    invoke-virtual {p0, p2}, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆混淆淆淆混混淆混淆混混淆淆淆淆混混混混混混淆混混淆混淆淆淆混混淆混混混淆混淆混混混淆混混混淆混淆混混混淆淆淆淆混混混混淆混淆混混淆混淆淆淆混淆混淆淆淆混淆混混混混淆淆混混淆混混淆淆混混淆混淆淆;->淆淆淆淆淆淆混淆混混混淆淆淆淆混淆淆混淆淆混混淆淆混混混淆淆淆淆淆淆混淆混淆混混混混混混混混混淆混混混淆混混混混混淆混淆混混淆淆混淆淆淆混淆混淆淆淆混混淆混混淆淆混混淆淆混淆淆淆淆淆混淆淆混混淆混混混([B)V

    return-void
.end method

.method public final 淆淆淆淆淆混淆混淆淆淆混混淆混混淆淆混混混混混淆淆混淆混混淆混混淆混混淆淆淆混淆混混淆混混混混混混混混混淆淆淆淆混混淆淆混淆淆混混淆混淆混淆混混混淆淆淆淆淆淆淆淆混混混混淆混混混淆淆混混淆淆混混淆淆混(L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆混淆淆混淆淆混混淆淆淆混淆淆淆淆混淆淆淆混混淆混淆混淆混混淆混混淆混混混淆淆淆淆混混混混淆淆淆混淆混淆淆淆混淆淆淆淆混淆淆淆混淆淆淆混混淆混淆淆淆混混淆淆淆混淆混淆混淆混混淆淆淆混淆混混淆混混;)V
    .registers 4

    new-instance v0, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆混淆淆淆混混淆混淆混混淆淆淆淆混混混混混混淆混混淆混淆淆淆混混淆混混混淆混淆混混混淆混混混淆混淆混混混淆淆淆淆混混混混淆混淆混混淆混淆淆淆混淆混淆淆淆混淆混混混混淆淆混混淆混混淆淆混混淆混淆淆$淆淆淆淆淆淆淆淆混淆淆混混混混混淆混混混混淆混混混混淆淆淆淆淆淆淆混混混淆混淆淆淆淆混混混混淆淆混淆混淆混淆混混混混混淆混淆淆混混混淆淆混淆淆混淆混混淆淆混淆混淆淆混淆混混混混混混混混淆混混淆淆淆混混;

    iget-object v1, p0, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆混淆淆淆混混淆混淆混混淆淆淆淆混混混混混混淆混混淆混淆淆淆混混淆混混混淆混淆混混混淆混混混淆混淆混混混淆淆淆淆混混混混淆混淆混混淆混淆淆淆混淆混淆淆淆混淆混混混混淆淆混混淆混混淆淆混混淆混淆淆;->淆淆淆淆淆淆淆淆混淆淆混混混混混淆混混混混淆混混混混淆淆淆淆淆淆淆混混混淆混淆淆淆淆混混混混淆淆混淆混淆混淆混混混混混淆混淆淆混混混淆淆混淆淆混淆混混淆淆混淆混淆淆混淆混混混混混混混混淆混混淆淆淆混混:Ljava/io/OutputStream;

    invoke-direct {v0, v1}, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆混淆淆淆混混淆混淆混混淆淆淆淆混混混混混混淆混混淆混淆淆淆混混淆混混混淆混淆混混混淆混混混淆混淆混混混淆淆淆淆混混混混淆混淆混混淆混淆淆淆混淆混淆淆淆混淆混混混混淆淆混混淆混混淆淆混混淆混淆淆$淆淆淆淆淆淆淆淆混淆淆混混混混混淆混混混混淆混混混混淆淆淆淆淆淆淆混混混淆混淆淆淆淆混混混混淆淆混淆混淆混淆混混混混混淆混淆淆混混混淆淆混淆淆混淆混混淆淆混淆混淆淆混淆混混混混混混混混淆混混淆淆淆混混;-><init>(Ljava/io/OutputStream;)V

    invoke-virtual {p1, v0}, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆混淆淆混淆淆混混淆淆淆混淆淆淆淆混淆淆淆混混淆混淆混淆混混淆混混淆混混混淆淆淆淆混混混混淆淆淆混淆混淆淆淆混淆淆淆淆混淆淆淆混淆淆淆混混淆混淆淆淆混混淆淆淆混淆混淆混淆混混淆淆淆混淆混混淆混混;->淆淆淆淆淆混淆混淆混淆淆淆混淆混淆淆淆淆淆混淆淆淆混淆淆淆淆淆混混淆混淆混淆混淆混混混淆混混混淆混混淆混混淆淆淆淆淆淆淆淆混淆混混淆混混混混混混混淆混淆混混混混淆混混混淆混混淆混淆淆淆混淆淆混淆淆淆淆(L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆混淆淆淆混混淆混淆混混淆淆淆淆混混混混混混淆混混淆混淆淆淆混混淆混混混淆混淆混混混淆混混混淆混淆混混混淆淆淆淆混混混混淆混淆混混淆混淆淆淆混淆混淆淆淆混淆混混混混淆淆混混淆混混淆淆混混淆混淆淆;)V

    return-void
.end method

.method public final 淆淆淆淆淆混淆混淆混淆淆淆混淆混淆淆淆淆淆混淆淆淆混淆淆淆淆淆混混淆混淆混淆混淆混混混淆混混混淆混混淆混混淆淆淆淆淆淆淆淆混淆混混淆混混混混混混混淆混淆混混混混淆混混混淆混混淆混淆淆淆混淆淆混淆淆淆淆(I)V
    .registers 4

    const/16 v0, 0x7f

    if-le p1, v0, :cond_1

    const/4 v1, 0x1

    move v0, p1

    :goto_0
    ushr-int/lit8 v0, v0, 0x8

    if-eqz v0, :cond_0

    add-int/lit8 v1, v1, 0x1

    goto :goto_0

    :cond_0
    or-int/lit16 v0, v1, 0x80

    int-to-byte v0, v0

    invoke-virtual {p0, v0}, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆混淆淆淆混混淆混淆混混淆淆淆淆混混混混混混淆混混淆混淆淆淆混混淆混混混淆混淆混混混淆混混混淆混淆混混混淆淆淆淆混混混混淆混淆混混淆混淆淆淆混淆混淆淆淆混淆混混混混淆淆混混淆混混淆淆混混淆混淆淆;->淆淆淆淆淆淆混淆淆混淆混混淆淆淆淆混混混混混淆淆淆淆淆混淆淆淆淆混混混混混混混淆淆淆淆混淆混混淆淆淆淆混混混淆混混淆淆淆淆混淆混混淆混淆淆淆淆混淆混淆淆混淆混淆淆淆混淆淆混淆混混淆淆混淆淆淆混混混混淆(I)V

    add-int/lit8 v0, v1, -0x1

    mul-int/lit8 v0, v0, 0x8

    :goto_1
    if-ltz v0, :cond_2

    shr-int v1, p1, v0

    int-to-byte v1, v1

    invoke-virtual {p0, v1}, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆混淆淆淆混混淆混淆混混淆淆淆淆混混混混混混淆混混淆混淆淆淆混混淆混混混淆混淆混混混淆混混混淆混淆混混混淆淆淆淆混混混混淆混淆混混淆混淆淆淆混淆混淆淆淆混淆混混混混淆淆混混淆混混淆淆混混淆混淆淆;->淆淆淆淆淆淆混淆淆混淆混混淆淆淆淆混混混混混淆淆淆淆淆混淆淆淆淆混混混混混混混淆淆淆淆混淆混混淆淆淆淆混混混淆混混淆淆淆淆混淆混混淆混淆淆淆淆混淆混淆淆混淆混淆淆淆混淆淆混淆混混淆淆混淆淆淆混混混混淆(I)V

    add-int/lit8 v0, v0, -0x8

    goto :goto_1

    :cond_1
    int-to-byte v0, p1

    invoke-virtual {p0, v0}, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆混淆淆淆混混淆混淆混混淆淆淆淆混混混混混混淆混混淆混淆淆淆混混淆混混混淆混淆混混混淆混混混淆混淆混混混淆淆淆淆混混混混淆混淆混混淆混淆淆淆混淆混淆淆淆混淆混混混混淆淆混混淆混混淆淆混混淆混淆淆;->淆淆淆淆淆淆混淆淆混淆混混淆淆淆淆混混混混混淆淆淆淆淆混淆淆淆淆混混混混混混混淆淆淆淆混淆混混淆淆淆淆混混混淆混混淆淆淆淆混淆混混淆混淆淆淆淆混淆混淆淆混淆混淆淆淆混淆淆混淆混混淆淆混淆淆淆混混混混淆(I)V

    :cond_2
    return-void
.end method

.method public 淆淆淆淆淆混混淆淆淆淆混混混淆混混混混淆混淆混混淆淆混混混淆淆混淆混淆混淆淆淆混混混淆淆混淆淆混淆淆淆混淆混淆淆淆淆混淆混混淆混混淆混混淆混混混混混淆混混混混混混淆淆淆混淆淆淆混淆混淆混混混淆混混混淆(L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆淆淆混淆混混混混混混淆混淆淆淆混淆淆淆淆淆淆混混混混淆淆混淆淆混混混淆混混淆淆混淆混淆淆混淆淆混混混淆淆混淆混混淆混混淆混淆淆淆混混淆混混淆混混混淆淆淆淆淆淆淆混淆淆淆混淆混淆淆淆淆淆淆混混混;)V
    .registers 4

    if-eqz p1, :cond_0

    invoke-interface {p1}, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆淆淆混淆混混混混混混淆混淆淆淆混淆淆淆淆淆淆混混混混淆淆混淆淆混混混淆混混淆淆混淆混淆淆混淆淆混混混淆淆混淆混混淆混混淆混淆淆淆混混淆混混淆混混混淆淆淆淆淆淆淆混淆淆淆混淆混淆淆淆淆淆淆混混混;->淆淆淆淆淆淆混淆混混混淆淆淆淆混淆淆混淆淆混混淆淆混混混淆淆淆淆淆淆混淆混淆混混混混混混混混混淆混混混淆混混混混混淆混淆混混淆淆混淆淆淆混淆混淆淆淆混混淆混混淆淆混混淆淆混淆淆淆淆淆混淆淆混混淆混混混()L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆混淆淆混淆淆混混淆淆淆混淆淆淆淆混淆淆淆混混淆混淆混淆混混淆混混淆混混混淆淆淆淆混混混混淆淆淆混淆混淆淆淆混淆淆淆淆混淆淆淆混淆淆淆混混淆混淆淆淆混混淆淆淆混淆混淆混淆混混淆淆淆混淆混混淆混混;

    move-result-object v0

    invoke-virtual {v0, p0}, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆混淆淆混淆淆混混淆淆淆混淆淆淆淆混淆淆淆混混淆混淆混淆混混淆混混淆混混混淆淆淆淆混混混混淆淆淆混淆混淆淆淆混淆淆淆淆混淆淆淆混淆淆淆混混淆混淆淆淆混混淆淆淆混淆混淆混淆混混淆淆淆混淆混混淆混混;->淆淆淆淆淆混淆混淆混淆淆淆混淆混淆淆淆淆淆混淆淆淆混淆淆淆淆淆混混淆混淆混淆混淆混混混淆混混混淆混混淆混混淆淆淆淆淆淆淆淆混淆混混淆混混混混混混混淆混淆混混混混淆混混混淆混混淆混淆淆淆混淆淆混淆淆淆淆(L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆混淆淆淆混混淆混淆混混淆淆淆淆混混混混混混淆混混淆混淆淆淆混混淆混混混淆混淆混混混淆混混混淆混淆混混混淆淆淆淆混混混混淆混淆混混淆混淆淆淆混淆混淆淆淆混淆混混混混淆淆混混淆混混淆淆混混淆混淆淆;)V

    return-void

    :cond_0
    new-instance v0, Ljava/io/IOException;

    const-string v1, "null object detected"

    invoke-direct {v0, v1}, Ljava/io/IOException;-><init>(Ljava/lang/String;)V

    throw v0
.end method

.method public final 淆淆淆淆淆混混淆淆混淆混淆淆淆混混淆淆混淆混混淆淆淆混淆淆淆淆混混淆淆混淆淆淆淆淆淆淆淆混淆混混淆淆混淆混淆淆混淆淆淆淆淆混混淆混淆淆混混淆淆淆淆混混混淆混淆混混淆淆混淆淆淆混混混混淆淆混淆淆淆淆淆混(II)V
    .registers 7

    const/4 v0, 0x4

    const/16 v1, 0x1f

    if-ge p2, v1, :cond_0

    or-int v0, p1, p2

    invoke-virtual {p0, v0}, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆混淆淆淆混混淆混淆混混淆淆淆淆混混混混混混淆混混淆混淆淆淆混混淆混混混淆混淆混混混淆混混混淆混淆混混混淆淆淆淆混混混混淆混淆混混淆混淆淆淆混淆混淆淆淆混淆混混混混淆淆混混淆混混淆淆混混淆混淆淆;->淆淆淆淆淆淆混淆淆混淆混混淆淆淆淆混混混混混淆淆淆淆淆混淆淆淆淆混混混混混混混淆淆淆淆混淆混混淆淆淆淆混混混淆混混淆淆淆淆混淆混混淆混淆淆淆淆混淆混淆淆混淆混淆淆淆混淆淆混淆混混淆淆混淆淆淆混混混混淆(I)V

    :goto_0
    return-void

    :cond_0
    or-int/lit8 v1, p1, 0x1f

    invoke-virtual {p0, v1}, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆混淆淆淆混混淆混淆混混淆淆淆淆混混混混混混淆混混淆混淆淆淆混混淆混混混淆混淆混混混淆混混混淆混淆混混混淆淆淆淆混混混混淆混淆混混淆混淆淆淆混淆混淆淆淆混淆混混混混淆淆混混淆混混淆淆混混淆混淆淆;->淆淆淆淆淆淆混淆淆混淆混混淆淆淆淆混混混混混淆淆淆淆淆混淆淆淆淆混混混混混混混淆淆淆淆混淆混混淆淆淆淆混混混淆混混淆淆淆淆混淆混混淆混淆淆淆淆混淆混淆淆混淆混淆淆淆混淆淆混淆混混淆淆混淆淆淆混混混混淆(I)V

    const/16 v1, 0x80

    if-ge p2, v1, :cond_1

    invoke-virtual {p0, p2}, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆混淆淆淆混混淆混淆混混淆淆淆淆混混混混混混淆混混淆混淆淆淆混混淆混混混淆混淆混混混淆混混混淆混淆混混混淆淆淆淆混混混混淆混淆混混淆混淆淆淆混淆混淆淆淆混淆混混混混淆淆混混淆混混淆淆混混淆混淆淆;->淆淆淆淆淆淆混淆淆混淆混混淆淆淆淆混混混混混淆淆淆淆淆混淆淆淆淆混混混混混混混淆淆淆淆混淆混混淆淆淆淆混混混淆混混淆淆淆淆混淆混混淆混淆淆淆淆混淆混淆淆混淆混淆淆淆混淆淆混淆混混淆淆混淆淆淆混混混混淆(I)V

    goto :goto_0

    :cond_1
    const/4 v1, 0x5

    new-array v1, v1, [B

    and-int/lit8 v2, p2, 0x7f

    int-to-byte v2, v2

    aput-byte v2, v1, v0

    :cond_2
    shr-int/lit8 p2, p2, 0x7

    add-int/lit8 v0, v0, -0x1

    and-int/lit8 v2, p2, 0x7f

    or-int/lit16 v2, v2, 0x80

    int-to-byte v2, v2

    aput-byte v2, v1, v0

    const/16 v2, 0x7f

    if-gt p2, v2, :cond_2

    iget-object v2, p0, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆混淆淆淆混混淆混淆混混淆淆淆淆混混混混混混淆混混淆混淆淆淆混混淆混混混淆混淆混混混淆混混混淆混淆混混混淆淆淆淆混混混混淆混淆混混淆混淆淆淆混淆混淆淆淆混淆混混混混淆淆混混淆混混淆淆混混淆混淆淆;->淆淆淆淆淆淆淆淆混淆淆混混混混混淆混混混混淆混混混混淆淆淆淆淆淆淆混混混淆混淆淆淆淆混混混混淆淆混淆混淆混淆混混混混混淆混淆淆混混混淆淆混淆淆混淆混混淆淆混淆混淆淆混淆混混混混混混混混淆混混淆淆淆混混:Ljava/io/OutputStream;

    rsub-int/lit8 v3, v0, 0x5

    invoke-virtual {v2, v1, v0, v3}, Ljava/io/OutputStream;->write([BII)V

    goto :goto_0
.end method
