.class public final L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆混淆淆淆混淆淆淆混淆淆混淆混淆混淆淆淆混淆淆淆淆淆混淆混混淆淆淆混混混混混混淆混淆混淆淆混混淆淆混混混混混混混混淆混淆混混混淆淆淆混混淆混混淆淆淆淆淆混混淆混混淆淆混淆混淆淆混淆淆淆混混淆淆淆淆;
.super L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆混淆淆混淆淆混混淆淆淆混淆淆淆淆混淆淆淆混混淆混淆混淆混混淆混混淆混混混淆淆淆淆混混混混淆淆淆混淆混淆淆淆混淆淆淆淆混淆淆淆混淆淆淆混混淆混淆淆淆混混淆淆淆混淆混淆混淆混混淆淆淆混淆混混淆混混;
.source "SourceFile"

# interfaces
.implements L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆混淆混混淆淆淆混淆淆淆淆混淆混淆混混混淆混混淆混淆混淆淆混混混淆淆混混淆淆淆淆淆淆混淆淆混淆淆淆淆淆淆混淆混混淆淆淆混淆淆混淆混淆淆混混淆混淆混混混混混混淆淆淆混混淆混淆淆混淆淆淆淆淆混淆淆淆;


# instance fields
.field public final 淆淆淆淆淆淆淆淆混淆淆混混混混混淆混混混混淆混混混混淆淆淆淆淆淆淆混混混淆混淆淆淆淆混混混混淆淆混淆混淆混淆混混混混混淆混淆淆混混混淆淆混淆淆混淆混混淆淆混淆混淆淆混淆混混混混混混混混淆混混淆淆淆混混:[C


# direct methods
.method public constructor <init>([C)V
    .registers 2

    invoke-direct {p0}, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆混淆淆混淆淆混混淆淆淆混淆淆淆淆混淆淆淆混混淆混淆混淆混混淆混混淆混混混淆淆淆淆混混混混淆淆淆混淆混淆淆淆混淆淆淆淆混淆淆淆混淆淆淆混混淆混淆淆淆混混淆淆淆混淆混淆混淆混混淆淆淆混淆混混淆混混;-><init>()V

    iput-object p1, p0, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆混淆淆淆混淆淆淆混淆淆混淆混淆混淆淆淆混淆淆淆淆淆混淆混混淆淆淆混混混混混混淆混淆混淆淆混混淆淆混混混混混混混混淆混淆混混混淆淆淆混混淆混混淆淆淆淆淆混混淆混混淆淆混淆混淆淆混淆淆淆混混淆淆淆淆;->淆淆淆淆淆淆淆淆混淆淆混混混混混淆混混混混淆混混混混淆淆淆淆淆淆淆混混混淆混淆淆淆淆混混混混淆淆混淆混淆混淆混混混混混淆混淆淆混混混淆淆混淆淆混淆混混淆淆混淆混淆淆混淆混混混混混混混混淆混混淆淆淆混混:[C

    return-void
.end method


# virtual methods
.method public final hashCode()I
    .registers 5

    iget-object v2, p0, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆混淆淆淆混淆淆淆混淆淆混淆混淆混淆淆淆混淆淆淆淆淆混淆混混淆淆淆混混混混混混淆混淆混淆淆混混淆淆混混混混混混混混淆混淆混混混淆淆淆混混淆混混淆淆淆淆淆混混淆混混淆淆混淆混淆淆混淆淆淆混混淆淆淆淆;->淆淆淆淆淆淆淆淆混淆淆混混混混混淆混混混混淆混混混混淆淆淆淆淆淆淆混混混淆混淆淆淆淆混混混混淆淆混淆混淆混淆混混混混混淆混淆淆混混混淆淆混淆淆混淆混混淆淆混淆混淆淆混淆混混混混混混混混淆混混淆淆淆混混:[C

    if-nez v2, :cond_1

    const/4 v0, 0x0

    :cond_0
    return v0

    :cond_1
    array-length v1, v2

    add-int/lit8 v0, v1, 0x1

    :goto_0
    add-int/lit8 v1, v1, -0x1

    if-ltz v1, :cond_0

    mul-int/lit16 v0, v0, 0x101

    aget-char v3, v2, v1

    xor-int/2addr v0, v3

    goto :goto_0
.end method

.method public final toString()Ljava/lang/String;
    .registers 2

    invoke-virtual {p0}, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆混淆淆淆混淆淆淆混淆淆混淆混淆混淆淆淆混淆淆淆淆淆混淆混混淆淆淆混混混混混混淆混淆混淆淆混混淆淆混混混混混混混混淆混淆混混混淆淆淆混混淆混混淆淆淆淆淆混混淆混混淆淆混淆混淆淆混淆淆淆混混淆淆淆淆;->淆淆淆淆淆淆淆淆混淆淆混混混混混淆混混混混淆混混混混淆淆淆淆淆淆淆混混混淆混淆淆淆淆混混混混淆淆混淆混淆混淆混混混混混淆混淆淆混混混淆淆混淆淆混淆混混淆淆混淆混淆淆混淆混混混混混混混混淆混混淆淆淆混混()Ljava/lang/String;

    move-result-object v0

    return-object v0
.end method

.method public final 淆淆淆淆淆淆淆淆混淆淆混混混混混淆混混混混淆混混混混淆淆淆淆淆淆淆混混混淆混淆淆淆淆混混混混淆淆混淆混淆混淆混混混混混淆混淆淆混混混淆淆混淆淆混淆混混淆淆混淆混淆淆混淆混混混混混混混混淆混混淆淆淆混混()Ljava/lang/String;
    .registers 3

    new-instance v0, Ljava/lang/String;

    iget-object v1, p0, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆混淆淆淆混淆淆淆混淆淆混淆混淆混淆淆淆混淆淆淆淆淆混淆混混淆淆淆混混混混混混淆混淆混淆淆混混淆淆混混混混混混混混淆混淆混混混淆淆淆混混淆混混淆淆淆淆淆混混淆混混淆淆混淆混淆淆混淆淆淆混混淆淆淆淆;->淆淆淆淆淆淆淆淆混淆淆混混混混混淆混混混混淆混混混混淆淆淆淆淆淆淆混混混淆混淆淆淆淆混混混混淆淆混淆混淆混淆混混混混混淆混淆淆混混混淆淆混淆淆混淆混混淆淆混淆混淆淆混淆混混混混混混混混淆混混淆淆淆混混:[C

    invoke-direct {v0, v1}, Ljava/lang/String;-><init>([C)V

    return-object v0
.end method

.method public final 淆淆淆淆淆混淆混淆淆淆混混淆混混淆淆混混混混混淆淆混淆混混淆混混淆混混淆淆淆混淆混混淆混混混混混混混混混淆淆淆淆混混淆淆混淆淆混混淆混淆混淆混混混淆淆淆淆淆淆淆淆混混混混淆混混混淆淆混混淆淆混混淆淆混(L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆混淆淆混淆淆混混淆淆淆混淆淆淆淆混淆淆淆混混淆混淆混淆混混淆混混淆混混混淆淆淆淆混混混混淆淆淆混淆混淆淆淆混淆淆淆淆混淆淆淆混淆淆淆混混淆混淆淆淆混混淆淆淆混淆混淆混淆混混淆淆淆混淆混混淆混混;)Z
    .registers 8

    const/4 v1, 0x0

    instance-of v0, p1, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆混淆淆淆混淆淆淆混淆淆混淆混淆混淆淆淆混淆淆淆淆淆混淆混混淆淆淆混混混混混混淆混淆混淆淆混混淆淆混混混混混混混混淆混淆混混混淆淆淆混混淆混混淆淆淆淆淆混混淆混混淆淆混淆混淆淆混淆淆淆混混淆淆淆淆;

    if-nez v0, :cond_1

    :cond_0
    :goto_0
    return v1

    :cond_1
    check-cast p1, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆混淆淆淆混淆淆淆混淆淆混淆混淆混淆淆淆混淆淆淆淆淆混淆混混淆淆淆混混混混混混淆混淆混淆淆混混淆淆混混混混混混混混淆混淆混混混淆淆淆混混淆混混淆淆淆淆淆混混淆混混淆淆混淆混淆淆混淆淆淆混混淆淆淆淆;

    iget-object v2, p0, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆混淆淆淆混淆淆淆混淆淆混淆混淆混淆淆淆混淆淆淆淆淆混淆混混淆淆淆混混混混混混淆混淆混淆淆混混淆淆混混混混混混混混淆混淆混混混淆淆淆混混淆混混淆淆淆淆淆混混淆混混淆淆混淆混淆淆混淆淆淆混混淆淆淆淆;->淆淆淆淆淆淆淆淆混淆淆混混混混混淆混混混混淆混混混混淆淆淆淆淆淆淆混混混淆混淆淆淆淆混混混混淆淆混淆混淆混淆混混混混混淆混淆淆混混混淆淆混淆淆混淆混混淆淆混淆混淆淆混淆混混混混混混混混淆混混淆淆淆混混:[C

    iget-object v3, p1, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆混淆淆淆混淆淆淆混淆淆混淆混淆混淆淆淆混淆淆淆淆淆混淆混混淆淆淆混混混混混混淆混淆混淆淆混混淆淆混混混混混混混混淆混淆混混混淆淆淆混混淆混混淆淆淆淆淆混混淆混混淆淆混淆混淆淆混淆淆淆混混淆淆淆淆;->淆淆淆淆淆淆淆淆混淆淆混混混混混淆混混混混淆混混混混淆淆淆淆淆淆淆混混混淆混淆淆淆淆混混混混淆淆混淆混淆混淆混混混混混淆混淆淆混混混淆淆混淆淆混淆混混淆淆混淆混淆淆混淆混混混混混混混混淆混混淆淆淆混混:[C

    if-ne v2, v3, :cond_3

    :cond_2
    const/4 v1, 0x1

    goto :goto_0

    :cond_3
    if-eqz v2, :cond_0

    if-eqz v3, :cond_0

    array-length v0, v2

    array-length v4, v3

    if-ne v0, v4, :cond_0

    move v0, v1

    :goto_1
    array-length v4, v2

    if-eq v0, v4, :cond_2

    aget-char v4, v2, v0

    aget-char v5, v3, v0

    if-ne v4, v5, :cond_0

    add-int/lit8 v0, v0, 0x1

    goto :goto_1
.end method

.method public final 淆淆淆淆淆混淆混淆混淆淆淆混淆混淆淆淆淆淆混淆淆淆混淆淆淆淆淆混混淆混淆混淆混淆混混混淆混混混淆混混淆混混淆淆淆淆淆淆淆淆混淆混混淆混混混混混混混淆混淆混混混混淆混混混淆混混淆混淆淆淆混淆淆混淆淆淆淆(L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆混淆淆淆混混淆混淆混混淆淆淆淆混混混混混混淆混混淆混淆淆淆混混淆混混混淆混淆混混混淆混混混淆混淆混混混淆淆淆淆混混混混淆混淆混混淆混淆淆淆混淆混淆淆淆混淆混混混混淆淆混混淆混混淆淆混混淆混淆淆;)V
    .registers 5

    const/16 v0, 0x1e

    invoke-virtual {p1, v0}, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆混淆淆淆混混淆混淆混混淆淆淆淆混混混混混混淆混混淆混淆淆淆混混淆混混混淆混淆混混混淆混混混淆混淆混混混淆淆淆淆混混混混淆混淆混混淆混淆淆淆混淆混淆淆淆混淆混混混混淆淆混混淆混混淆淆混混淆混淆淆;->淆淆淆淆淆淆混淆淆混淆混混淆淆淆淆混混混混混淆淆淆淆淆混淆淆淆淆混混混混混混混淆淆淆淆混淆混混淆淆淆淆混混混淆混混淆淆淆淆混淆混混淆混淆淆淆淆混淆混淆淆混淆混淆淆淆混淆淆混淆混混淆淆混淆淆淆混混混混淆(I)V

    iget-object v0, p0, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆混淆淆淆混淆淆淆混淆淆混淆混淆混淆淆淆混淆淆淆淆淆混淆混混淆淆淆混混混混混混淆混淆混淆淆混混淆淆混混混混混混混混淆混淆混混混淆淆淆混混淆混混淆淆淆淆淆混混淆混混淆淆混淆混淆淆混淆淆淆混混淆淆淆淆;->淆淆淆淆淆淆淆淆混淆淆混混混混混淆混混混混淆混混混混淆淆淆淆淆淆淆混混混淆混淆淆淆淆混混混混淆淆混淆混淆混淆混混混混混淆混淆淆混混混淆淆混淆淆混淆混混淆淆混淆混淆淆混淆混混混混混混混混淆混混淆淆淆混混:[C

    array-length v0, v0

    mul-int/lit8 v0, v0, 0x2

    invoke-virtual {p1, v0}, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆混淆淆淆混混淆混淆混混淆淆淆淆混混混混混混淆混混淆混淆淆淆混混淆混混混淆混淆混混混淆混混混淆混淆混混混淆淆淆淆混混混混淆混淆混混淆混淆淆淆混淆混淆淆淆混淆混混混混淆淆混混淆混混淆淆混混淆混淆淆;->淆淆淆淆淆混淆混淆混淆淆淆混淆混淆淆淆淆淆混淆淆淆混淆淆淆淆淆混混淆混淆混淆混淆混混混淆混混混淆混混淆混混淆淆淆淆淆淆淆淆混淆混混淆混混混混混混混淆混淆混混混混淆混混混淆混混淆混淆淆淆混淆淆混淆淆淆淆(I)V

    const/4 v0, 0x0

    :goto_0
    iget-object v1, p0, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆混淆淆淆混淆淆淆混淆淆混淆混淆混淆淆淆混淆淆淆淆淆混淆混混淆淆淆混混混混混混淆混淆混淆淆混混淆淆混混混混混混混混淆混淆混混混淆淆淆混混淆混混淆淆淆淆淆混混淆混混淆淆混淆混淆淆混淆淆淆混混淆淆淆淆;->淆淆淆淆淆淆淆淆混淆淆混混混混混淆混混混混淆混混混混淆淆淆淆淆淆淆混混混淆混淆淆淆淆混混混混淆淆混淆混淆混淆混混混混混淆混淆淆混混混淆淆混淆淆混淆混混淆淆混淆混淆淆混淆混混混混混混混混淆混混淆淆淆混混:[C

    array-length v2, v1

    if-eq v0, v2, :cond_0

    aget-char v1, v1, v0

    shr-int/lit8 v2, v1, 0x8

    int-to-byte v2, v2

    invoke-virtual {p1, v2}, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆混淆淆淆混混淆混淆混混淆淆淆淆混混混混混混淆混混淆混淆淆淆混混淆混混混淆混淆混混混淆混混混淆混淆混混混淆淆淆淆混混混混淆混淆混混淆混淆淆淆混淆混淆淆淆混淆混混混混淆淆混混淆混混淆淆混混淆混淆淆;->淆淆淆淆淆淆混淆淆混淆混混淆淆淆淆混混混混混淆淆淆淆淆混淆淆淆淆混混混混混混混淆淆淆淆混淆混混淆淆淆淆混混混淆混混淆淆淆淆混淆混混淆混淆淆淆淆混淆混淆淆混淆混淆淆淆混淆淆混淆混混淆淆混淆淆淆混混混混淆(I)V

    int-to-byte v1, v1

    invoke-virtual {p1, v1}, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆淆混淆淆淆混混淆混淆混混淆淆淆淆混混混混混混淆混混淆混淆淆淆混混淆混混混淆混淆混混混淆混混混淆混淆混混混淆淆淆淆混混混混淆混淆混混淆混淆淆淆混淆混淆淆淆混淆混混混混淆淆混混淆混混淆淆混混淆混淆淆;->淆淆淆淆淆淆混淆淆混淆混混淆淆淆淆混混混混混淆淆淆淆淆混淆淆淆淆混混混混混混混淆淆淆淆混淆混混淆淆淆淆混混混淆混混淆淆淆淆混淆混混淆混淆淆淆淆混淆混淆淆混淆混淆淆淆混淆淆混淆混混淆淆混淆淆淆混混混混淆(I)V

    add-int/lit8 v0, v0, 0x1

    goto :goto_0

    :cond_0
    return-void
.end method

.method public final 淆淆淆淆淆混混淆淆淆淆混混混淆混混混混淆混淆混混淆淆混混混淆淆混淆混淆混淆淆淆混混混淆淆混淆淆混淆淆淆混淆混淆淆淆淆混淆混混淆混混淆混混淆混混混混混淆混混混混混混淆淆淆混淆淆淆混淆混淆混混混淆混混混淆()I
    .registers 3

    iget-object v0, p0, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆混淆淆淆混淆淆淆混淆淆混淆混淆混淆淆淆混淆淆淆淆淆混淆混混淆淆淆混混混混混混淆混淆混淆淆混混淆淆混混混混混混混混淆混淆混混混淆淆淆混混淆混混淆淆淆淆淆混混淆混混淆淆混淆混淆淆混淆淆淆混混淆淆淆淆;->淆淆淆淆淆淆淆淆混淆淆混混混混混淆混混混混淆混混混混淆淆淆淆淆淆淆混混混淆混淆淆淆淆混混混混淆淆混淆混淆混淆混混混混混淆混淆淆混混混淆淆混淆淆混淆混混淆淆混淆混淆淆混淆混混混混混混混混淆混混淆淆淆混混:[C

    array-length v0, v0

    mul-int/lit8 v0, v0, 0x2

    invoke-static {v0}, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆混混淆混混混混混混淆淆混混淆混混淆淆淆淆淆淆混混淆混混混淆淆混淆混淆混混淆淆淆混混淆淆混淆淆淆淆淆淆淆淆淆淆淆混混混混混淆混淆淆淆淆混混混混混淆混淆混混淆淆淆淆淆混混混混淆混混淆混淆混淆混淆淆淆;->淆淆淆淆淆淆淆淆混淆淆混混混混混淆混混混混淆混混混混淆淆淆淆淆淆淆混混混淆混淆淆淆淆混混混混淆淆混淆混淆混淆混混混混混淆混淆淆混混混淆淆混淆淆混淆混混淆淆混淆混淆淆混淆混混混混混混混混淆混混淆淆淆混混(I)I

    move-result v0

    iget-object v1, p0, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆混淆淆淆混淆淆淆混淆淆混淆混淆混淆淆淆混淆淆淆淆淆混淆混混淆淆淆混混混混混混淆混淆混淆淆混混淆淆混混混混混混混混淆混淆混混混淆淆淆混混淆混混淆淆淆淆淆混混淆混混淆淆混淆混淆淆混淆淆淆混混淆淆淆淆;->淆淆淆淆淆淆淆淆混淆淆混混混混混淆混混混混淆混混混混淆淆淆淆淆淆淆混混混淆混淆淆淆淆混混混混淆淆混淆混淆混淆混混混混混淆混淆淆混混混淆淆混淆淆混淆混混淆淆混淆混淆淆混淆混混混混混混混混淆混混淆淆淆混混:[C

    array-length v1, v1

    mul-int/lit8 v1, v1, 0x2

    add-int/lit8 v0, v0, 0x1

    add-int/2addr v0, v1

    return v0
.end method

.method public final 淆淆淆淆淆混混淆淆混混混淆淆混混淆淆混混淆混混混混混淆淆混混混淆混淆混淆混混混淆淆淆淆混混淆混混淆混混淆混混混淆混混混淆混混混混混淆混淆混淆混淆淆混混淆混混淆混淆混淆混混淆淆混混混淆淆混混混淆混混淆淆()Z
    .registers 2

    const/4 v0, 0x0

    return v0
.end method
