.class public final L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆混混淆混淆混淆混淆淆混淆混混淆混混淆混淆混淆混混淆淆混混淆混混混混混淆混淆淆淆淆混淆淆混混淆淆淆淆淆淆混淆混混淆淆混淆混混淆淆淆混淆淆淆混混混淆淆混混淆混淆淆淆混淆淆混淆淆淆淆淆混淆混淆淆淆混混;
.super L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆混混淆混混混淆混混淆淆淆淆淆混淆淆混淆淆淆混淆淆淆淆淆淆淆混混混淆混淆淆淆淆混混混混淆混混混淆混淆淆淆淆混混混淆淆混淆淆淆混淆淆淆淆混混混淆淆淆混混淆混混淆混混淆淆淆淆混混淆淆混混混混淆淆混混混;
.source "SourceFile"


# instance fields
.field public 淆淆淆淆淆淆混淆淆混淆混混淆淆淆淆混混混混混淆淆淆淆淆混淆淆淆淆混混混混混混混淆淆淆淆混淆混混淆淆淆淆混混混淆混混淆淆淆淆混淆混混淆混淆淆淆淆混淆混淆淆混淆混淆淆淆混淆淆混淆混混淆淆混淆淆淆混混混混淆:I

.field public 淆淆淆淆淆淆混淆混混混淆淆淆淆混淆淆混淆淆混混淆淆混混混淆淆淆淆淆淆混淆混淆混混混混混混混混混淆混混混淆混混混混混淆混淆混混淆淆混淆淆淆混淆混淆淆淆混混淆混混淆淆混混淆淆混淆淆淆淆淆混淆淆混混淆混混混:I

.field public 淆淆淆淆淆淆混淆混混混混混混淆混淆淆淆混淆淆淆淆淆淆混混混混淆淆混淆淆混混混淆混混淆淆混淆混淆淆混淆淆混混混淆淆混淆混混淆混混淆混淆淆淆混混淆混混淆混混混淆淆淆淆淆淆淆混淆淆淆混淆混淆淆淆淆淆淆混混混:Z

.field public 淆淆淆淆淆混淆淆混混混淆混混淆混混混淆混淆淆混淆淆混混混混混淆淆淆淆淆淆淆混混混淆淆淆淆淆淆淆混淆混淆混混混淆混淆混淆混混淆淆混混淆混淆淆淆混混混混淆混淆混混淆淆混淆淆淆淆淆淆混混淆混混混混淆淆淆混混:Z


# direct methods
.method public constructor <init>(Ljava/io/InputStream;I)V
    .registers 4

    invoke-direct {p0, p1, p2}, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆混混淆混混混淆混混淆淆淆淆淆混淆淆混淆淆淆混淆淆淆淆淆淆淆混混混淆混淆淆淆淆混混混混淆混混混淆混淆淆淆淆混混混淆淆混淆淆淆混淆淆淆淆混混混淆淆淆混混淆混混淆混混淆淆淆淆混混淆淆混混混混淆淆混混混;-><init>(Ljava/io/InputStream;I)V

    const/4 v0, 0x0

    iput-boolean v0, p0, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆混混淆混淆混淆混淆淆混淆混混淆混混淆混淆混淆混混淆淆混混淆混混混混混淆混淆淆淆淆混淆淆混混淆淆淆淆淆淆混淆混混淆淆混淆混混淆淆淆混淆淆淆混混混淆淆混混淆混淆淆淆混淆淆混淆淆淆淆淆混淆混淆淆淆混混;->淆淆淆淆淆淆混淆混混混混混混淆混淆淆淆混淆淆淆淆淆淆混混混混淆淆混淆淆混混混淆混混淆淆混淆混淆淆混淆淆混混混淆淆混淆混混淆混混淆混淆淆淆混混淆混混淆混混混淆淆淆淆淆淆淆混淆淆淆混淆混淆淆淆淆淆淆混混混:Z

    const/4 v0, 0x1

    iput-boolean v0, p0, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆混混淆混淆混淆混淆淆混淆混混淆混混淆混淆混淆混混淆淆混混淆混混混混混淆混淆淆淆淆混淆淆混混淆淆淆淆淆淆混淆混混淆淆混淆混混淆淆淆混淆淆淆混混混淆淆混混淆混淆淆淆混淆淆混淆淆淆淆淆混淆混淆淆淆混混;->淆淆淆淆淆混淆淆混混混淆混混淆混混混淆混淆淆混淆淆混混混混混淆淆淆淆淆淆淆混混混淆淆淆淆淆淆淆混淆混淆混混混淆混淆混淆混混淆淆混混淆混淆淆淆混混混混淆混淆混混淆淆混淆淆淆淆淆淆混混淆混混混混淆淆淆混混:Z

    invoke-virtual {p1}, Ljava/io/InputStream;->read()I

    move-result v0

    iput v0, p0, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆混混淆混淆混淆混淆淆混淆混混淆混混淆混淆混淆混混淆淆混混淆混混混混混淆混淆淆淆淆混淆淆混混淆淆淆淆淆淆混淆混混淆淆混淆混混淆淆淆混淆淆淆混混混淆淆混混淆混淆淆淆混淆淆混淆淆淆淆淆混淆混淆淆淆混混;->淆淆淆淆淆淆混淆淆混淆混混淆淆淆淆混混混混混淆淆淆淆淆混淆淆淆淆混混混混混混混淆淆淆淆混淆混混淆淆淆淆混混混淆混混淆淆淆淆混淆混混淆混淆淆淆淆混淆混淆淆混淆混淆淆淆混淆淆混淆混混淆淆混淆淆淆混混混混淆:I

    invoke-virtual {p1}, Ljava/io/InputStream;->read()I

    move-result v0

    iput v0, p0, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆混混淆混淆混淆混淆淆混淆混混淆混混淆混淆混淆混混淆淆混混淆混混混混混淆混淆淆淆淆混淆淆混混淆淆淆淆淆淆混淆混混淆淆混淆混混淆淆淆混淆淆淆混混混淆淆混混淆混淆淆淆混淆淆混淆淆淆淆淆混淆混淆淆淆混混;->淆淆淆淆淆淆混淆混混混淆淆淆淆混淆淆混淆淆混混淆淆混混混淆淆淆淆淆淆混淆混淆混混混混混混混混混淆混混混淆混混混混混淆混淆混混淆淆混淆淆淆混淆混淆淆淆混混淆混混淆淆混混淆淆混淆淆淆淆淆混淆淆混混淆混混混:I

    if-ltz v0, :cond_0

    invoke-virtual {p0}, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆混混淆混淆混淆混淆淆混淆混混淆混混淆混淆混淆混混淆淆混混淆混混混混混淆混淆淆淆淆混淆淆混混淆淆淆淆淆淆混淆混混淆淆混淆混混淆淆淆混淆淆淆混混混淆淆混混淆混淆淆淆混淆淆混淆淆淆淆淆混淆混淆淆淆混混;->淆淆淆淆淆淆混淆淆混淆混混淆淆淆淆混混混混混淆淆淆淆淆混淆淆淆淆混混混混混混混淆淆淆淆混淆混混淆淆淆淆混混混淆混混淆淆淆淆混淆混混淆混淆淆淆淆混淆混淆淆混淆混淆淆淆混淆淆混淆混混淆淆混淆淆淆混混混混淆()Z

    return-void

    :cond_0
    new-instance v0, Ljava/io/EOFException;

    invoke-direct {v0}, Ljava/io/EOFException;-><init>()V

    throw v0
.end method


# virtual methods
.method public final read()I
    .registers 4

    invoke-virtual {p0}, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆混混淆混淆混淆混淆淆混淆混混淆混混淆混淆混淆混混淆淆混混淆混混混混混淆混淆淆淆淆混淆淆混混淆淆淆淆淆淆混淆混混淆淆混淆混混淆淆淆混淆淆淆混混混淆淆混混淆混淆淆淆混淆淆混淆淆淆淆淆混淆混淆淆淆混混;->淆淆淆淆淆淆混淆淆混淆混混淆淆淆淆混混混混混淆淆淆淆淆混淆淆淆淆混混混混混混混淆淆淆淆混淆混混淆淆淆淆混混混淆混混淆淆淆淆混淆混混淆混淆淆淆淆混淆混淆淆混淆混淆淆淆混淆淆混淆混混淆淆混淆淆淆混混混混淆()Z

    move-result v0

    if-eqz v0, :cond_0

    const/4 v0, -0x1

    :goto_0
    return v0

    :cond_0
    iget-object v0, p0, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆混混淆混混混淆混混淆淆淆淆淆混淆淆混淆淆淆混淆淆淆淆淆淆淆混混混淆混淆淆淆淆混混混混淆混混混淆混淆淆淆淆混混混淆淆混淆淆淆混淆淆淆淆混混混淆淆淆混混淆混混淆混混淆淆淆淆混混淆淆混混混混淆淆混混混;->淆淆淆淆淆淆淆淆混淆淆混混混混混淆混混混混淆混混混混淆淆淆淆淆淆淆混混混淆混淆淆淆淆混混混混淆淆混淆混淆混淆混混混混混淆混淆淆混混混淆淆混淆淆混淆混混淆淆混淆混淆淆混淆混混混混混混混混淆混混淆淆淆混混:Ljava/io/InputStream;

    invoke-virtual {v0}, Ljava/io/InputStream;->read()I

    move-result v1

    if-ltz v1, :cond_1

    iget v0, p0, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆混混淆混淆混淆混淆淆混淆混混淆混混淆混淆混淆混混淆淆混混淆混混混混混淆混淆淆淆淆混淆淆混混淆淆淆淆淆淆混淆混混淆淆混淆混混淆淆淆混淆淆淆混混混淆淆混混淆混淆淆淆混淆淆混淆淆淆淆淆混淆混淆淆淆混混;->淆淆淆淆淆淆混淆淆混淆混混淆淆淆淆混混混混混淆淆淆淆淆混淆淆淆淆混混混混混混混淆淆淆淆混淆混混淆淆淆淆混混混淆混混淆淆淆淆混淆混混淆混淆淆淆淆混淆混淆淆混淆混淆淆淆混淆淆混淆混混淆淆混淆淆淆混混混混淆:I

    iget v2, p0, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆混混淆混淆混淆混淆淆混淆混混淆混混淆混淆混淆混混淆淆混混淆混混混混混淆混淆淆淆淆混淆淆混混淆淆淆淆淆淆混淆混混淆淆混淆混混淆淆淆混淆淆淆混混混淆淆混混淆混淆淆淆混淆淆混淆淆淆淆淆混淆混淆淆淆混混;->淆淆淆淆淆淆混淆混混混淆淆淆淆混淆淆混淆淆混混淆淆混混混淆淆淆淆淆淆混淆混淆混混混混混混混混混淆混混混淆混混混混混淆混淆混混淆淆混淆淆淆混淆混淆淆淆混混淆混混淆淆混混淆淆混淆淆淆淆淆混淆淆混混淆混混混:I

    iput v2, p0, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆混混淆混淆混淆混淆淆混淆混混淆混混淆混淆混淆混混淆淆混混淆混混混混混淆混淆淆淆淆混淆淆混混淆淆淆淆淆淆混淆混混淆淆混淆混混淆淆淆混淆淆淆混混混淆淆混混淆混淆淆淆混淆淆混淆淆淆淆淆混淆混淆淆淆混混;->淆淆淆淆淆淆混淆淆混淆混混淆淆淆淆混混混混混淆淆淆淆淆混淆淆淆淆混混混混混混混淆淆淆淆混淆混混淆淆淆淆混混混淆混混淆淆淆淆混淆混混淆混淆淆淆淆混淆混淆淆混淆混淆淆淆混淆淆混淆混混淆淆混淆淆淆混混混混淆:I

    iput v1, p0, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆混混淆混淆混淆混淆淆混淆混混淆混混淆混淆混淆混混淆淆混混淆混混混混混淆混淆淆淆淆混淆淆混混淆淆淆淆淆淆混淆混混淆淆混淆混混淆淆淆混淆淆淆混混混淆淆混混淆混淆淆淆混淆淆混淆淆淆淆淆混淆混淆淆淆混混;->淆淆淆淆淆淆混淆混混混淆淆淆淆混淆淆混淆淆混混淆淆混混混淆淆淆淆淆淆混淆混淆混混混混混混混混混淆混混混淆混混混混混淆混淆混混淆淆混淆淆淆混淆混淆淆淆混混淆混混淆淆混混淆淆混淆淆淆淆淆混淆淆混混淆混混混:I

    goto :goto_0

    :cond_1
    new-instance v0, Ljava/io/EOFException;

    invoke-direct {v0}, Ljava/io/EOFException;-><init>()V

    throw v0
.end method

.method public final read([BII)I
    .registers 7

    iget-boolean v0, p0, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆混混淆混淆混淆混淆淆混淆混混淆混混淆混淆混淆混混淆淆混混淆混混混混混淆混淆淆淆淆混淆淆混混淆淆淆淆淆淆混淆混混淆淆混淆混混淆淆淆混淆淆淆混混混淆淆混混淆混淆淆淆混淆淆混淆淆淆淆淆混淆混淆淆淆混混;->淆淆淆淆淆混淆淆混混混淆混混淆混混混淆混淆淆混淆淆混混混混混淆淆淆淆淆淆淆混混混淆淆淆淆淆淆淆混淆混淆混混混淆混淆混淆混混淆淆混混淆混淆淆淆混混混混淆混淆混混淆淆混淆淆淆淆淆淆混混淆混混混混淆淆淆混混:Z

    if-nez v0, :cond_0

    const/4 v0, 0x3

    if-ge p3, v0, :cond_1

    :cond_0
    invoke-super {p0, p1, p2, p3}, Ljava/io/InputStream;->read([BII)I

    move-result v0

    :goto_0
    return v0

    :cond_1
    iget-boolean v0, p0, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆混混淆混淆混淆混淆淆混淆混混淆混混淆混淆混淆混混淆淆混混淆混混混混混淆混淆淆淆淆混淆淆混混淆淆淆淆淆淆混淆混混淆淆混淆混混淆淆淆混淆淆淆混混混淆淆混混淆混淆淆淆混淆淆混淆淆淆淆淆混淆混淆淆淆混混;->淆淆淆淆淆淆混淆混混混混混混淆混淆淆淆混淆淆淆淆淆淆混混混混淆淆混淆淆混混混淆混混淆淆混淆混淆淆混淆淆混混混淆淆混淆混混淆混混淆混淆淆淆混混淆混混淆混混混淆淆淆淆淆淆淆混淆淆淆混淆混淆淆淆淆淆淆混混混:Z

    if-eqz v0, :cond_2

    const/4 v0, -0x1

    goto :goto_0

    :cond_2
    iget-object v0, p0, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆混混淆混混混淆混混淆淆淆淆淆混淆淆混淆淆淆混淆淆淆淆淆淆淆混混混淆混淆淆淆淆混混混混淆混混混淆混淆淆淆淆混混混淆淆混淆淆淆混淆淆淆淆混混混淆淆淆混混淆混混淆混混淆淆淆淆混混淆淆混混混混淆淆混混混;->淆淆淆淆淆淆淆淆混淆淆混混混混混淆混混混混淆混混混混淆淆淆淆淆淆淆混混混淆混淆淆淆淆混混混混淆淆混淆混淆混淆混混混混混淆混淆淆混混混淆淆混淆淆混淆混混淆淆混淆混淆淆混淆混混混混混混混混淆混混淆淆淆混混:Ljava/io/InputStream;

    add-int/lit8 v1, p2, 0x2

    add-int/lit8 v2, p3, -0x2

    invoke-virtual {v0, p1, v1, v2}, Ljava/io/InputStream;->read([BII)I

    move-result v0

    if-ltz v0, :cond_4

    iget v1, p0, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆混混淆混淆混淆混淆淆混淆混混淆混混淆混淆混淆混混淆淆混混淆混混混混混淆混淆淆淆淆混淆淆混混淆淆淆淆淆淆混淆混混淆淆混淆混混淆淆淆混淆淆淆混混混淆淆混混淆混淆淆淆混淆淆混淆淆淆淆淆混淆混淆淆淆混混;->淆淆淆淆淆淆混淆淆混淆混混淆淆淆淆混混混混混淆淆淆淆淆混淆淆淆淆混混混混混混混淆淆淆淆混淆混混淆淆淆淆混混混淆混混淆淆淆淆混淆混混淆混淆淆淆淆混淆混淆淆混淆混淆淆淆混淆淆混淆混混淆淆混淆淆淆混混混混淆:I

    int-to-byte v1, v1

    aput-byte v1, p1, p2

    add-int/lit8 v1, p2, 0x1

    iget v2, p0, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆混混淆混淆混淆混淆淆混淆混混淆混混淆混淆混淆混混淆淆混混淆混混混混混淆混淆淆淆淆混淆淆混混淆淆淆淆淆淆混淆混混淆淆混淆混混淆淆淆混淆淆淆混混混淆淆混混淆混淆淆淆混淆淆混淆淆淆淆淆混淆混淆淆淆混混;->淆淆淆淆淆淆混淆混混混淆淆淆淆混淆淆混淆淆混混淆淆混混混淆淆淆淆淆淆混淆混淆混混混混混混混混混淆混混混淆混混混混混淆混淆混混淆淆混淆淆淆混淆混淆淆淆混混淆混混淆淆混混淆淆混淆淆淆淆淆混淆淆混混淆混混混:I

    int-to-byte v2, v2

    aput-byte v2, p1, v1

    iget-object v1, p0, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆混混淆混混混淆混混淆淆淆淆淆混淆淆混淆淆淆混淆淆淆淆淆淆淆混混混淆混淆淆淆淆混混混混淆混混混淆混淆淆淆淆混混混淆淆混淆淆淆混淆淆淆淆混混混淆淆淆混混淆混混淆混混淆淆淆淆混混淆淆混混混混淆淆混混混;->淆淆淆淆淆淆淆淆混淆淆混混混混混淆混混混混淆混混混混淆淆淆淆淆淆淆混混混淆混淆淆淆淆混混混混淆淆混淆混淆混淆混混混混混淆混淆淆混混混淆淆混淆淆混淆混混淆淆混淆混淆淆混淆混混混混混混混混淆混混淆淆淆混混:Ljava/io/InputStream;

    invoke-virtual {v1}, Ljava/io/InputStream;->read()I

    move-result v1

    iput v1, p0, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆混混淆混淆混淆混淆淆混淆混混淆混混淆混淆混淆混混淆淆混混淆混混混混混淆混淆淆淆淆混淆淆混混淆淆淆淆淆淆混淆混混淆淆混淆混混淆淆淆混淆淆淆混混混淆淆混混淆混淆淆淆混淆淆混淆淆淆淆淆混淆混淆淆淆混混;->淆淆淆淆淆淆混淆淆混淆混混淆淆淆淆混混混混混淆淆淆淆淆混淆淆淆淆混混混混混混混淆淆淆淆混淆混混淆淆淆淆混混混淆混混淆淆淆淆混淆混混淆混淆淆淆淆混淆混淆淆混淆混淆淆淆混淆淆混淆混混淆淆混淆淆淆混混混混淆:I

    iget-object v1, p0, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆混混淆混混混淆混混淆淆淆淆淆混淆淆混淆淆淆混淆淆淆淆淆淆淆混混混淆混淆淆淆淆混混混混淆混混混淆混淆淆淆淆混混混淆淆混淆淆淆混淆淆淆淆混混混淆淆淆混混淆混混淆混混淆淆淆淆混混淆淆混混混混淆淆混混混;->淆淆淆淆淆淆淆淆混淆淆混混混混混淆混混混混淆混混混混淆淆淆淆淆淆淆混混混淆混淆淆淆淆混混混混淆淆混淆混淆混淆混混混混混淆混淆淆混混混淆淆混淆淆混淆混混淆淆混淆混淆淆混淆混混混混混混混混淆混混淆淆淆混混:Ljava/io/InputStream;

    invoke-virtual {v1}, Ljava/io/InputStream;->read()I

    move-result v1

    iput v1, p0, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆混混淆混淆混淆混淆淆混淆混混淆混混淆混淆混淆混混淆淆混混淆混混混混混淆混淆淆淆淆混淆淆混混淆淆淆淆淆淆混淆混混淆淆混淆混混淆淆淆混淆淆淆混混混淆淆混混淆混淆淆淆混淆淆混淆淆淆淆淆混淆混淆淆淆混混;->淆淆淆淆淆淆混淆混混混淆淆淆淆混淆淆混淆淆混混淆淆混混混淆淆淆淆淆淆混淆混淆混混混混混混混混混淆混混混淆混混混混混淆混淆混混淆淆混淆淆淆混淆混淆淆淆混混淆混混淆淆混混淆淆混淆淆淆淆淆混淆淆混混淆混混混:I

    if-ltz v1, :cond_3

    add-int/lit8 v0, v0, 0x2

    goto :goto_0

    :cond_3
    new-instance v0, Ljava/io/EOFException;

    invoke-direct {v0}, Ljava/io/EOFException;-><init>()V

    throw v0

    :cond_4
    new-instance v0, Ljava/io/EOFException;

    invoke-direct {v0}, Ljava/io/EOFException;-><init>()V

    throw v0
.end method

.method public final 淆淆淆淆淆淆混淆淆混淆混混淆淆淆淆混混混混混淆淆淆淆淆混淆淆淆淆混混混混混混混淆淆淆淆混淆混混淆淆淆淆混混混淆混混淆淆淆淆混淆混混淆混淆淆淆淆混淆混淆淆混淆混淆淆淆混淆淆混淆混混淆淆混淆淆淆混混混混淆()Z
    .registers 2

    iget-boolean v0, p0, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆混混淆混淆混淆混淆淆混淆混混淆混混淆混淆混淆混混淆淆混混淆混混混混混淆混淆淆淆淆混淆淆混混淆淆淆淆淆淆混淆混混淆淆混淆混混淆淆淆混淆淆淆混混混淆淆混混淆混淆淆淆混淆淆混淆淆淆淆淆混淆混淆淆淆混混;->淆淆淆淆淆淆混淆混混混混混混淆混淆淆淆混淆淆淆淆淆淆混混混混淆淆混淆淆混混混淆混混淆淆混淆混淆淆混淆淆混混混淆淆混淆混混淆混混淆混淆淆淆混混淆混混淆混混混淆淆淆淆淆淆淆混淆淆淆混淆混淆淆淆淆淆淆混混混:Z

    if-nez v0, :cond_0

    iget-boolean v0, p0, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆混混淆混淆混淆混淆淆混淆混混淆混混淆混淆混淆混混淆淆混混淆混混混混混淆混淆淆淆淆混淆淆混混淆淆淆淆淆淆混淆混混淆淆混淆混混淆淆淆混淆淆淆混混混淆淆混混淆混淆淆淆混淆淆混淆淆淆淆淆混淆混淆淆淆混混;->淆淆淆淆淆混淆淆混混混淆混混淆混混混淆混淆淆混淆淆混混混混混淆淆淆淆淆淆淆混混混淆淆淆淆淆淆淆混淆混淆混混混淆混淆混淆混混淆淆混混淆混淆淆淆混混混混淆混淆混混淆淆混淆淆淆淆淆淆混混淆混混混混淆淆淆混混:Z

    if-eqz v0, :cond_0

    iget v0, p0, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆混混淆混淆混淆混淆淆混淆混混淆混混淆混淆混淆混混淆淆混混淆混混混混混淆混淆淆淆淆混淆淆混混淆淆淆淆淆淆混淆混混淆淆混淆混混淆淆淆混淆淆淆混混混淆淆混混淆混淆淆淆混淆淆混淆淆淆淆淆混淆混淆淆淆混混;->淆淆淆淆淆淆混淆淆混淆混混淆淆淆淆混混混混混淆淆淆淆淆混淆淆淆淆混混混混混混混淆淆淆淆混淆混混淆淆淆淆混混混淆混混淆淆淆淆混淆混混淆混淆淆淆淆混淆混淆淆混淆混淆淆淆混淆淆混淆混混淆淆混淆淆淆混混混混淆:I

    if-nez v0, :cond_0

    iget v0, p0, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆混混淆混淆混淆混淆淆混淆混混淆混混淆混淆混淆混混淆淆混混淆混混混混混淆混淆淆淆淆混淆淆混混淆淆淆淆淆淆混淆混混淆淆混淆混混淆淆淆混淆淆淆混混混淆淆混混淆混淆淆淆混淆淆混淆淆淆淆淆混淆混淆淆淆混混;->淆淆淆淆淆淆混淆混混混淆淆淆淆混淆淆混淆淆混混淆淆混混混淆淆淆淆淆淆混淆混淆混混混混混混混混混淆混混混淆混混混混混淆混淆混混淆淆混淆淆淆混淆混淆淆淆混混淆混混淆淆混混淆淆混淆淆淆淆淆混淆淆混混淆混混混:I

    if-nez v0, :cond_0

    const/4 v0, 0x1

    iput-boolean v0, p0, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆混混淆混淆混淆混淆淆混淆混混淆混混淆混淆混淆混混淆淆混混淆混混混混混淆混淆淆淆淆混淆淆混混淆淆淆淆淆淆混淆混混淆淆混淆混混淆淆淆混淆淆淆混混混淆淆混混淆混淆淆淆混淆淆混淆淆淆淆淆混淆混淆淆淆混混;->淆淆淆淆淆淆混淆混混混混混混淆混淆淆淆混淆淆淆淆淆淆混混混混淆淆混淆淆混混混淆混混淆淆混淆混淆淆混淆淆混混混淆淆混淆混混淆混混淆混淆淆淆混混淆混混淆混混混淆淆淆淆淆淆淆混淆淆淆混淆混淆淆淆淆淆淆混混混:Z

    invoke-virtual {p0}, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆混混淆混混混淆混混淆淆淆淆淆混淆淆混淆淆淆混淆淆淆淆淆淆淆混混混淆混淆淆淆淆混混混混淆混混混淆混淆淆淆淆混混混淆淆混淆淆淆混淆淆淆淆混混混淆淆淆混混淆混混淆混混淆淆淆淆混混淆淆混混混混淆淆混混混;->淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆()V

    :cond_0
    iget-boolean v0, p0, L淆淆淆淆淆淆淆淆混混淆淆淆混混混淆混混混混淆淆混混混混混淆淆淆混淆淆混淆淆淆淆淆混淆淆混混混淆混淆混淆混混淆混淆淆混淆混混混混淆淆淆淆混混混淆淆混混淆混淆淆淆混淆混混混淆混混混混淆淆混混淆淆淆混混淆淆/淆淆淆混混淆混淆混淆混淆淆混淆混混淆混混淆混淆混淆混混淆淆混混淆混混混混混淆混淆淆淆淆混淆淆混混淆淆淆淆淆淆混淆混混淆淆混淆混混淆淆淆混淆淆淆混混混淆淆混混淆混淆淆淆混淆淆混淆淆淆淆淆混淆混淆淆淆混混;->淆淆淆淆淆淆混淆混混混混混混淆混淆淆淆混淆淆淆淆淆淆混混混混淆淆混淆淆混混混淆混混淆淆混淆混淆淆混淆淆混混混淆淆混淆混混淆混混淆混淆淆淆混混淆混混淆混混混淆淆淆淆淆淆淆混淆淆淆混淆混淆淆淆淆淆淆混混混:Z

    return v0
.end method
